/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {

pub const SYS_TRACE_ID_MUTEX_LOCK: u32 = 35;
pub const SYS_TRACE_ID_SEMA_INIT: u32 = 36;
pub const SYS_TRACE_ID_SEMA_GIVE: u32 = 37;
pub const SYS_TRACE_ID_SEMA_TAKE: u32 = 38;
pub const Z_DEVICE_MAX_NAME_LEN: u32 = 48;
pub const NET_LOG_LEVEL: u32 = 0;
pub const LOG_LEVEL: u32 = 0;
pub const LOG_MAX_NARGS: u32 = 15;
pub const LOG_MSG_NARGS_SINGLE_CHUNK: u32 = 3;
pub const LOG_MSG_NARGS_HEAD_CHUNK: u32 = 2;
pub const LOG_MSG_TYPE_STD: u32 = 0;
pub const LOG_MSG_TYPE_HEXDUMP: u32 = 1;
pub const LOG_MSG_HEXDUMP_LENGTH_BITS: u32 = 13;
pub const LOG_MSG_HEXDUMP_MAX_LENGTH: u32 = 8191;
pub const CONFIG_LOG_DEFAULT_LEVEL: u32 = 0;
pub const CONFIG_LOG_DOMAIN_ID: u32 = 0;
pub const CONFIG_LOG_MAX_LEVEL: u32 = 0;
pub const LOG_LEVEL_BITS: u32 = 3;
pub const LOG_FILTER_SLOT_SIZE: u32 = 3;
pub const LOG_FILTERS_NUM_OF_SLOTS: u32 = 10;
pub const LOG_FILTER_SLOT_MASK: u32 = 7;
pub const LOG_FILTER_AGGR_SLOT_IDX: u32 = 0;
pub const LOG_FILTER_FIRST_BACKEND_SLOT_IDX: u32 = 1;
pub const LOG_LEVEL_NONE: u32 = 0;
pub const LOG_LEVEL_ERR: u32 = 1;
pub const LOG_LEVEL_WRN: u32 = 2;
pub const LOG_LEVEL_INF: u32 = 3;
pub const LOG_LEVEL_DBG: u32 = 4;
pub const NET_TC_TX_COUNT: u32 = 1;
pub const NET_TC_RX_COUNT: u32 = 1;
pub const NET_TC_COUNT: u32 = 1;
pub const NET_IF_MAX_IPV6_ADDR: u32 = 0;
pub const NET_IF_MAX_IPV6_MADDR: u32 = 0;
pub const NET_IF_MAX_IPV6_PREFIX: u32 = 0;
pub const NET_IF_MAX_IPV4_ADDR: u32 = 1;
pub const NET_IF_MAX_IPV4_MADDR: u32 = 1;
pub const NET_IF_MAX_CONFIGS: u32 = 1;
pub const NET_CONTEXT_STATE_SHIFT: u32 = 1;
pub const NET_CONTEXT_STATE_MASK: u32 = 3;
pub const DNS_MAX_NAME_SIZE: u32 = 20;
pub const CONFIG_DNS_RESOLVER_MAX_SERVERS: u32 = 1;
pub const CONFIG_DNS_NUM_CONCUR_QUERIES: u32 = 1;
pub const MDNS_SERVER_COUNT: u32 = 0;
pub const LLMNR_SERVER_COUNT: u32 = 0;
pub const DNS_MAX_MCAST_SERVERS: u32 = 0;
pub const ZSOCK_POLLIN: u32 = 1;
pub const ZSOCK_POLLOUT: u32 = 4;
pub const ZSOCK_POLLERR: u32 = 8;
pub const ZSOCK_POLLHUP: u32 = 16;
pub const ZSOCK_POLLNVAL: u32 = 32;
pub const ZSOCK_MSG_PEEK: u32 = 2;
pub const ZSOCK_MSG_DONTWAIT: u32 = 64;
pub const SOL_TLS: u32 = 282;
pub const TLS_SEC_TAG_LIST: u32 = 1;
pub const TLS_HOSTNAME: u32 = 2;
pub const TLS_CIPHERSUITE_LIST: u32 = 3;
pub const TLS_CIPHERSUITE_USED: u32 = 4;
pub const TLS_PEER_VERIFY: u32 = 5;
pub const TLS_DTLS_ROLE: u32 = 6;
pub const POLLIN: u32 = 1;
pub const POLLOUT: u32 = 4;
pub const POLLERR: u32 = 8;
pub const POLLHUP: u32 = 16;
pub const POLLNVAL: u32 = 32;
pub const MSG_PEEK: u32 = 2;
pub const MSG_DONTWAIT: u32 = 64;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type wchar_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: cty::c_longlong,
    pub __clang_max_align_nonce2: f64,
    pub __bindgen_padding_0: u32,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        24usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type FILE = cty::c_int;
extern "C" {
    pub fn printf(fmt: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn snprintf(s: *mut cty::c_char, len: usize, fmt: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn sprintf(s: *mut cty::c_char, fmt: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn fprintf(stream: *mut FILE, format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn vprintf(fmt: *const cty::c_char, list: va_list) -> cty::c_int;
}
extern "C" {
    pub fn vsnprintf(
        s: *mut cty::c_char,
        len: usize,
        fmt: *const cty::c_char,
        list: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn vsprintf(s: *mut cty::c_char, fmt: *const cty::c_char, list: va_list) -> cty::c_int;
}
extern "C" {
    pub fn vfprintf(stream: *mut FILE, format: *const cty::c_char, ap: va_list) -> cty::c_int;
}
extern "C" {
    pub fn puts(s: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn fputc(c: cty::c_int, stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fputs(s: *const cty::c_char, stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fwrite(
        ptr: *const cty::c_void,
        size: usize,
        nitems: usize,
        stream: *mut FILE,
    ) -> cty::c_uint;
}
pub type int_fast8_t = cty::c_int;
pub type int_fast16_t = cty::c_int;
pub type int_fast32_t = cty::c_int;
pub type int_fast64_t = cty::c_longlong;
pub type int_least8_t = cty::c_schar;
pub type int_least16_t = cty::c_short;
pub type int_least32_t = cty::c_int;
pub type int_least64_t = cty::c_longlong;
pub type uint_fast8_t = cty::c_uint;
pub type uint_fast16_t = cty::c_uint;
pub type uint_fast32_t = cty::c_uint;
pub type uint_fast64_t = cty::c_ulonglong;
pub type uint_least8_t = cty::c_uchar;
pub type uint_least16_t = cty::c_ushort;
pub type uint_least32_t = cty::c_uint;
pub type uint_least64_t = cty::c_ulonglong;
pub type s8_t = cty::c_schar;
pub type s16_t = cty::c_short;
pub type s32_t = cty::c_int;
pub type s64_t = cty::c_longlong;
pub type u8_t = cty::c_uchar;
pub type u16_t = cty::c_ushort;
pub type u32_t = cty::c_uint;
pub type u64_t = cty::c_ulonglong;
extern "C" {
    pub fn hdlr_aio_cmp_disable(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_aio_cmp_get_pending_int(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_err_check(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_poll_in(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_poll_out(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_configure(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_config_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_irq_tx_enable(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_irq_tx_disable(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_irq_rx_enable(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_irq_rx_disable(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_irq_err_enable(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_irq_err_disable(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_irq_is_pending(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_irq_update(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_line_ctrl_set(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_line_ctrl_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_uart_drv_cmd(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_sensor_attr_set(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_sensor_sample_fetch(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_sensor_sample_fetch_chan(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_sensor_channel_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_entropy_get_entropy(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_dma_start(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_dma_stop(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_ipm_send(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_ipm_max_data_size_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_ipm_max_id_val_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_ipm_set_enabled(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_led_blink(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_led_set_brightness(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_led_on(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_led_off(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_can_send(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_can_attach_msgq(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_can_attach_isr(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_can_detach(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_can_configure(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_spi_transceive(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_spi_release(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_gpio_config(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_gpio_write(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_gpio_read(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_gpio_enable_callback(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_gpio_disable_callback(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_gpio_get_pending_int(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_counter_start(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_counter_stop(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_counter_read(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_counter_get_pending_int(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2s_configure(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2s_buf_read(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2s_buf_write(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2s_trigger(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_object_access_grant(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_object_release(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_object_alloc(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_create(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_sleep(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_busy_wait(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_yield(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_wakeup(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_current_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_abort(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_start(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_priority_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_priority_set(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_deadline_set(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_suspend(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_resume(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_is_preempt_thread(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_custom_data_set(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_custom_data_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_name_set(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_thread_name_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_timer_start(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_timer_stop(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_timer_status_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_timer_status_sync(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_timer_remaining_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_timer_user_data_set(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_timer_user_data_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_uptime_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_uptime_get_32(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_queue_init(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_queue_cancel_wait(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_queue_alloc_append(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_queue_alloc_prepend(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_queue_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_queue_is_empty(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_queue_peek_head(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_queue_peek_tail(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_stack_alloc_init(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_stack_push(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_stack_pop(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_mutex_init(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_mutex_lock(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_mutex_unlock(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_sem_init(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_sem_take(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_sem_give(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_sem_reset(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_sem_count_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_alert_recv(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_alert_send(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_msgq_alloc_init(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_msgq_put(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_msgq_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_msgq_peek(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_msgq_purge(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_msgq_num_free_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_msgq_get_attrs(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_msgq_num_used_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_pipe_alloc_init(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_pipe_put(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_pipe_get(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_poll(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_poll_signal_init(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_poll_signal_reset(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_poll_signal_check(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_poll_signal_raise(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_k_str_out(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2c_configure(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2c_transfer(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2c_slave_register(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2c_slave_unregister(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2c_slave_driver_register(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_i2c_slave_driver_unregister(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_device_get_binding(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_pwm_pin_set_cycles(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_pwm_get_cycles_per_sec(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_rtc_read(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_rtc_enable(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_rtc_disable(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_rtc_set_alarm(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_rtc_get_pending_int(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_flash_read(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_flash_write(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_flash_erase(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_flash_write_protection_set(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_flash_get_page_info_by_offs(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_flash_get_page_info_by_idx(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_flash_get_page_count(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_flash_get_write_block_size(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_z_errno(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr__zephyr_read(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr__zephyr_write(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr__zephyr_fputc(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr__zephyr_fwrite(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_socket(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_close(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_bind(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_connect(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_listen(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_accept(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_sendto(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_recvfrom(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_fcntl(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_poll(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_zsock_inet_pton(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
extern "C" {
    pub fn hdlr_z_zsock_getaddrinfo_internal(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t;
}
#[doc = " @typedef _k_syscall_handler_t"]
#[doc = " @brief System call handler function type"]
#[doc = ""]
#[doc = " These are kernel-side skeleton functions for system calls. They are"]
#[doc = " necessary to sanitize the arguments passed into the system call:"]
#[doc = ""]
#[doc = " - Any kernel object or device pointers are validated with _SYSCALL_IS_OBJ()"]
#[doc = " - Any memory buffers passed in are checked to ensure that the calling thread"]
#[doc = "   actually has access to them"]
#[doc = " - Many kernel calls do no sanity checking of parameters other than"]
#[doc = "   assertions. The handler must check all of these conditions using"]
#[doc = "   _SYSCALL_ASSERT()"]
#[doc = " - If the system call has more than 6 arguments, then arg6 will be a pointer"]
#[doc = "   to some struct containing arguments 6+. The struct itself needs to be"]
#[doc = "   validated like any other buffer passed in from userspace, and its members"]
#[doc = "   individually validated (if necessary) and then passed to the real"]
#[doc = "   implementation like normal arguments"]
#[doc = ""]
#[doc = " Even if the system call implementation has no return value, these always"]
#[doc = " return something, even 0, to prevent register leakage to userspace."]
#[doc = ""]
#[doc = " Once everything has been validated, the real implementation will be executed."]
#[doc = ""]
#[doc = " @param arg1 system call argument 1"]
#[doc = " @param arg2 system call argument 2"]
#[doc = " @param arg3 system call argument 3"]
#[doc = " @param arg4 system call argument 4"]
#[doc = " @param arg5 system call argument 5"]
#[doc = " @param arg6 system call argument 6"]
#[doc = " @param ssf System call stack frame pointer. Used to generate kernel oops"]
#[doc = "            via _arch_syscall_oops_at(). Contents are arch-specific."]
#[doc = " @return system call return value, or 0 if the system call implementation"]
#[doc = "         return void"]
#[doc = ""]
pub type _k_syscall_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        arg4: u32_t,
        arg5: u32_t,
        arg6: u32_t,
        ssf: *mut cty::c_void,
    ) -> u32_t,
>;
extern "C" {
    pub fn _impl_z_errno() -> *mut cty::c_int;
}
pub type off_t = cty::c_long;
extern "C" {
    pub fn strcpy(d: *mut cty::c_char, s: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strncpy(d: *mut cty::c_char, s: *const cty::c_char, n: usize) -> *mut cty::c_char;
}
extern "C" {
    pub fn strchr(s: *const cty::c_char, c: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn strrchr(s: *const cty::c_char, c: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn strlen(s: *const cty::c_char) -> cty::c_uint;
}
extern "C" {
    pub fn strcmp(s1: *const cty::c_char, s2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn strncmp(s1: *const cty::c_char, s2: *const cty::c_char, n: usize) -> cty::c_int;
}
extern "C" {
    pub fn strcat(dest: *mut cty::c_char, src: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strncat(d: *mut cty::c_char, s: *const cty::c_char, n: usize) -> *mut cty::c_char;
}
extern "C" {
    pub fn strstr(s: *const cty::c_char, find: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn memcmp(m1: *const cty::c_void, m2: *const cty::c_void, n: usize) -> cty::c_int;
}
extern "C" {
    pub fn memmove(d: *mut cty::c_void, s: *const cty::c_void, n: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn memcpy(d: *mut cty::c_void, s: *const cty::c_void, n: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn memset(buf: *mut cty::c_void, c: cty::c_int, n: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn memchr(s: *const cty::c_void, c: cty::c_uchar, n: usize) -> *mut cty::c_void;
}
pub const net_link_type_NET_LINK_UNKNOWN: net_link_type = 0;
pub const net_link_type_NET_LINK_IEEE802154: net_link_type = 1;
pub const net_link_type_NET_LINK_BLUETOOTH: net_link_type = 2;
pub const net_link_type_NET_LINK_ETHERNET: net_link_type = 3;
pub const net_link_type_NET_LINK_DUMMY: net_link_type = 4;
#[doc = " Type of the link address. This indicates the network technology that this"]
#[doc = " address is used in. Note that in order to save space we store the value"]
#[doc = " into a u8_t variable, so please do not introduce any values > 255 in"]
#[doc = " this enum."]
pub type net_link_type = u8;
#[doc = "  @brief Hardware link address structure"]
#[doc = ""]
#[doc = "  Used to hold the link address information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct net_linkaddr {
    #[doc = " The array of byte representing the address"]
    pub addr: *mut u8_t,
    #[doc = " Length of that address array"]
    pub len: u8_t,
    #[doc = " What kind of address is this for"]
    pub type_: u8_t,
}
#[test]
fn bindgen_test_layout_net_linkaddr() {
    assert_eq!(
        ::core::mem::size_of::<net_linkaddr>(),
        8usize,
        concat!("Size of: ", stringify!(net_linkaddr))
    );
    assert_eq!(
        ::core::mem::align_of::<net_linkaddr>(),
        4usize,
        concat!("Alignment of ", stringify!(net_linkaddr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_linkaddr>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_linkaddr),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_linkaddr>())).len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(net_linkaddr),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_linkaddr>())).type_ as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(net_linkaddr),
            "::",
            stringify!(type_)
        )
    );
}
#[doc = "  @brief Hardware link address structure"]
#[doc = ""]
#[doc = "  Used to hold the link address information. This variant is needed"]
#[doc = "  when we have to store the link layer address."]
#[doc = ""]
#[doc = "  Note that you cannot cast this to net_linkaddr as u8_t * is"]
#[doc = "  handled differently than u8_t addr[] and the fields are purposely"]
#[doc = "  in a different order."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct net_linkaddr_storage {
    #[doc = " What kind of address is this for"]
    pub type_: u8_t,
    #[doc = " The real length of the ll address."]
    pub len: u8_t,
    #[doc = " The array of bytes representing the address"]
    pub addr: [u8_t; 6usize],
}
#[test]
fn bindgen_test_layout_net_linkaddr_storage() {
    assert_eq!(
        ::core::mem::size_of::<net_linkaddr_storage>(),
        8usize,
        concat!("Size of: ", stringify!(net_linkaddr_storage))
    );
    assert_eq!(
        ::core::mem::align_of::<net_linkaddr_storage>(),
        1usize,
        concat!("Alignment of ", stringify!(net_linkaddr_storage))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_linkaddr_storage>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_linkaddr_storage),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_linkaddr_storage>())).len as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(net_linkaddr_storage),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_linkaddr_storage>())).addr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(net_linkaddr_storage),
            "::",
            stringify!(addr)
        )
    );
}
pub const net_ip_protocol_IPPROTO_ICMP: net_ip_protocol = 1;
pub const net_ip_protocol_IPPROTO_TCP: net_ip_protocol = 6;
pub const net_ip_protocol_IPPROTO_UDP: net_ip_protocol = 17;
pub const net_ip_protocol_IPPROTO_ICMPV6: net_ip_protocol = 58;
#[doc = " Protocol numbers from IANA"]
pub type net_ip_protocol = u32;
pub const net_ip_protocol_secure_IPPROTO_TLS_1_0: net_ip_protocol_secure = 256;
pub const net_ip_protocol_secure_IPPROTO_TLS_1_1: net_ip_protocol_secure = 257;
pub const net_ip_protocol_secure_IPPROTO_TLS_1_2: net_ip_protocol_secure = 258;
pub const net_ip_protocol_secure_IPPROTO_DTLS_1_0: net_ip_protocol_secure = 272;
pub const net_ip_protocol_secure_IPPROTO_DTLS_1_2: net_ip_protocol_secure = 273;
pub type net_ip_protocol_secure = u32;
pub const net_lte_protocol_NPROTO_AT: net_lte_protocol = 513;
pub type net_lte_protocol = u32;
pub const net_sock_type_SOCK_STREAM: net_sock_type = 1;
pub const net_sock_type_SOCK_DGRAM: net_sock_type = 2;
#[doc = " Socket type"]
pub type net_sock_type = u32;
#[doc = " IPv6 address structure"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __bindgen_anon_1: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub s6_addr: [u8_t; 16usize],
    pub s6_addr16: [u16_t; 8usize],
    pub s6_addr32: [u32_t; 4usize],
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<in6_addr__bindgen_ty_1>())).s6_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(s6_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<in6_addr__bindgen_ty_1>())).s6_addr16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(s6_addr16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<in6_addr__bindgen_ty_1>())).s6_addr32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(s6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    assert_eq!(
        ::core::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::core::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
}
#[doc = " IPv4 address"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in_addr {
    pub __bindgen_anon_1: in_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in_addr__bindgen_ty_1 {
    pub s4_addr: [u8_t; 4usize],
    pub s4_addr16: [u16_t; 2usize],
    pub s4_addr32: [u32_t; 1usize],
    pub s_addr: u32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_in_addr__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<in_addr__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<in_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<in_addr__bindgen_ty_1>())).s4_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr__bindgen_ty_1),
            "::",
            stringify!(s4_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<in_addr__bindgen_ty_1>())).s4_addr16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr__bindgen_ty_1),
            "::",
            stringify!(s4_addr16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<in_addr__bindgen_ty_1>())).s4_addr32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr__bindgen_ty_1),
            "::",
            stringify!(s4_addr32)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<in_addr__bindgen_ty_1>())).s_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr__bindgen_ty_1),
            "::",
            stringify!(s_addr)
        )
    );
}
#[test]
fn bindgen_test_layout_in_addr() {
    assert_eq!(
        ::core::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::core::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
}
pub type sa_family_t = cty::c_ushort;
pub type socklen_t = usize;
#[doc = " Note that the sin_port and sin6_port are in network byte order"]
#[doc = " in various sockaddr* structs."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: u16_t,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u8_t,
}
#[test]
fn bindgen_test_layout_sockaddr_in6() {
    assert_eq!(
        ::core::mem::size_of::<sockaddr_in6>(),
        24usize,
        concat!("Size of: ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        ::core::mem::align_of::<sockaddr_in6>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in6>())).sin6_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in6>())).sin6_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in6>())).sin6_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in6>())).sin6_scope_id as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in6_ptr {
    pub sin6_family: sa_family_t,
    pub sin6_port: u16_t,
    pub sin6_addr: *mut in6_addr,
    pub sin6_scope_id: u8_t,
}
#[test]
fn bindgen_test_layout_sockaddr_in6_ptr() {
    assert_eq!(
        ::core::mem::size_of::<sockaddr_in6_ptr>(),
        12usize,
        concat!("Size of: ", stringify!(sockaddr_in6_ptr))
    );
    assert_eq!(
        ::core::mem::align_of::<sockaddr_in6_ptr>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in6_ptr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in6_ptr>())).sin6_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6_ptr),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in6_ptr>())).sin6_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6_ptr),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in6_ptr>())).sin6_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6_ptr),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in6_ptr>())).sin6_scope_id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6_ptr),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: u16_t,
    pub sin_addr: in_addr,
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    assert_eq!(
        ::core::mem::size_of::<sockaddr_in>(),
        8usize,
        concat!("Size of: ", stringify!(sockaddr_in))
    );
    assert_eq!(
        ::core::mem::align_of::<sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in>())).sin_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in>())).sin_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in>())).sin_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in_ptr {
    pub sin_family: sa_family_t,
    pub sin_port: u16_t,
    pub sin_addr: *mut in_addr,
}
#[test]
fn bindgen_test_layout_sockaddr_in_ptr() {
    assert_eq!(
        ::core::mem::size_of::<sockaddr_in_ptr>(),
        8usize,
        concat!("Size of: ", stringify!(sockaddr_in_ptr))
    );
    assert_eq!(
        ::core::mem::align_of::<sockaddr_in_ptr>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in_ptr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in_ptr>())).sin_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in_ptr),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in_ptr>())).sin_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in_ptr),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_in_ptr>())).sin_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in_ptr),
            "::",
            stringify!(sin_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub data: [cty::c_char; 6usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    assert_eq!(
        ::core::mem::size_of::<sockaddr>(),
        8usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::core::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr>())).sa_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr>())).data as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_ptr {
    pub family: sa_family_t,
    pub data: [cty::c_char; 6usize],
}
#[test]
fn bindgen_test_layout_sockaddr_ptr() {
    assert_eq!(
        ::core::mem::size_of::<sockaddr_ptr>(),
        8usize,
        concat!("Size of: ", stringify!(sockaddr_ptr))
    );
    assert_eq!(
        ::core::mem::align_of::<sockaddr_ptr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr_ptr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_ptr>())).family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_ptr),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_ptr>())).data as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_ptr),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub data: [cty::c_char; 6usize],
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    assert_eq!(
        ::core::mem::size_of::<sockaddr_storage>(),
        8usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::core::mem::align_of::<sockaddr_storage>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_storage>())).ss_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sockaddr_storage>())).data as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct net_addr {
    pub family: sa_family_t,
    pub __bindgen_anon_1: net_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union net_addr__bindgen_ty_1 {
    pub in_addr: in_addr,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_net_addr__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<net_addr__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(net_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<net_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(net_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_addr__bindgen_ty_1>())).in_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_addr__bindgen_ty_1),
            "::",
            stringify!(in_addr)
        )
    );
}
#[test]
fn bindgen_test_layout_net_addr() {
    assert_eq!(
        ::core::mem::size_of::<net_addr>(),
        8usize,
        concat!("Size of: ", stringify!(net_addr))
    );
    assert_eq!(
        ::core::mem::align_of::<net_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(net_addr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_addr>())).family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_addr),
            "::",
            stringify!(family)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}in6addr_any"]
    pub static in6addr_any: in6_addr;
}
extern "C" {
    #[link_name = "\u{1}in6addr_loopback"]
    pub static in6addr_loopback: in6_addr;
}
pub const net_priority_NET_PRIORITY_BK: net_priority = 1;
pub const net_priority_NET_PRIORITY_BE: net_priority = 0;
pub const net_priority_NET_PRIORITY_EE: net_priority = 2;
pub const net_priority_NET_PRIORITY_CA: net_priority = 3;
pub const net_priority_NET_PRIORITY_VI: net_priority = 4;
pub const net_priority_NET_PRIORITY_VO: net_priority = 5;
pub const net_priority_NET_PRIORITY_IC: net_priority = 6;
pub const net_priority_NET_PRIORITY_NC: net_priority = 7;
#[doc = " Network packet priority settings described in IEEE 802.1Q Annex I.1"]
pub type net_priority = u8;
#[doc = " IPv6/IPv4 network connection tuple"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct net_tuple {
    #[doc = " IPv6/IPv4 remote address"]
    pub remote_addr: *mut net_addr,
    #[doc = " IPv6/IPv4 local address"]
    pub local_addr: *mut net_addr,
    #[doc = " UDP/TCP remote port"]
    pub remote_port: u16_t,
    #[doc = " UDP/TCP local port"]
    pub local_port: u16_t,
    #[doc = " IP protocol"]
    pub ip_proto: net_ip_protocol,
}
#[test]
fn bindgen_test_layout_net_tuple() {
    assert_eq!(
        ::core::mem::size_of::<net_tuple>(),
        16usize,
        concat!("Size of: ", stringify!(net_tuple))
    );
    assert_eq!(
        ::core::mem::align_of::<net_tuple>(),
        4usize,
        concat!("Alignment of ", stringify!(net_tuple))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tuple>())).remote_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tuple),
            "::",
            stringify!(remote_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tuple>())).local_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tuple),
            "::",
            stringify!(local_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tuple>())).remote_port as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tuple),
            "::",
            stringify!(remote_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tuple>())).local_port as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tuple),
            "::",
            stringify!(local_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tuple>())).ip_proto as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tuple),
            "::",
            stringify!(ip_proto)
        )
    );
}
pub const net_addr_type_NET_ADDR_ANY: net_addr_type = 0;
pub const net_addr_type_NET_ADDR_AUTOCONF: net_addr_type = 1;
pub const net_addr_type_NET_ADDR_DHCP: net_addr_type = 2;
pub const net_addr_type_NET_ADDR_MANUAL: net_addr_type = 3;
pub const net_addr_type_NET_ADDR_OVERRIDABLE: net_addr_type = 4;
#[doc = " How the network address is assigned to network interface"]
pub type net_addr_type = u8;
pub const net_addr_state_NET_ADDR_ANY_STATE: net_addr_state = -1;
pub const net_addr_state_NET_ADDR_TENTATIVE: net_addr_state = 0;
pub const net_addr_state_NET_ADDR_PREFERRED: net_addr_state = 1;
pub const net_addr_state_NET_ADDR_DEPRECATED: net_addr_state = 2;
#[doc = " What is the current state of the network address"]
pub type net_addr_state = i8;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct net_ipv6_hdr {
    pub vtc: u8_t,
    pub tcflow: u8_t,
    pub flow: u16_t,
    pub len: u16_t,
    pub nexthdr: u8_t,
    pub hop_limit: u8_t,
    pub src: in6_addr,
    pub dst: in6_addr,
}
#[test]
fn bindgen_test_layout_net_ipv6_hdr() {
    assert_eq!(
        ::core::mem::size_of::<net_ipv6_hdr>(),
        40usize,
        concat!("Size of: ", stringify!(net_ipv6_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<net_ipv6_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(net_ipv6_hdr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_hdr>())).vtc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_hdr),
            "::",
            stringify!(vtc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_hdr>())).tcflow as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_hdr),
            "::",
            stringify!(tcflow)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_hdr>())).flow as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_hdr),
            "::",
            stringify!(flow)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_hdr>())).len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_hdr),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_hdr>())).nexthdr as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_hdr),
            "::",
            stringify!(nexthdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_hdr>())).hop_limit as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_hdr),
            "::",
            stringify!(hop_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_hdr>())).src as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_hdr),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_hdr>())).dst as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_hdr),
            "::",
            stringify!(dst)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct net_ipv6_frag_hdr {
    pub nexthdr: u8_t,
    pub reserved: u8_t,
    pub offset: u16_t,
    pub id: u32_t,
}
#[test]
fn bindgen_test_layout_net_ipv6_frag_hdr() {
    assert_eq!(
        ::core::mem::size_of::<net_ipv6_frag_hdr>(),
        8usize,
        concat!("Size of: ", stringify!(net_ipv6_frag_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<net_ipv6_frag_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(net_ipv6_frag_hdr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_frag_hdr>())).nexthdr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_frag_hdr),
            "::",
            stringify!(nexthdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_frag_hdr>())).reserved as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_frag_hdr),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_frag_hdr>())).offset as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_frag_hdr),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv6_frag_hdr>())).id as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv6_frag_hdr),
            "::",
            stringify!(id)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct net_ipv4_hdr {
    pub vhl: u8_t,
    pub tos: u8_t,
    pub len: u16_t,
    pub id: [u8_t; 2usize],
    pub offset: [u8_t; 2usize],
    pub ttl: u8_t,
    pub proto: u8_t,
    pub chksum: u16_t,
    pub src: in_addr,
    pub dst: in_addr,
}
#[test]
fn bindgen_test_layout_net_ipv4_hdr() {
    assert_eq!(
        ::core::mem::size_of::<net_ipv4_hdr>(),
        20usize,
        concat!("Size of: ", stringify!(net_ipv4_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<net_ipv4_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(net_ipv4_hdr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).vhl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(vhl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).tos as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(tos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).len as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).id as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).offset as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).ttl as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(ttl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).proto as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(proto)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).chksum as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(chksum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).src as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_ipv4_hdr>())).dst as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(net_ipv4_hdr),
            "::",
            stringify!(dst)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct net_icmp_hdr {
    pub type_: u8_t,
    pub code: u8_t,
    pub chksum: u16_t,
}
#[test]
fn bindgen_test_layout_net_icmp_hdr() {
    assert_eq!(
        ::core::mem::size_of::<net_icmp_hdr>(),
        4usize,
        concat!("Size of: ", stringify!(net_icmp_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<net_icmp_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(net_icmp_hdr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_icmp_hdr>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_icmp_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_icmp_hdr>())).code as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(net_icmp_hdr),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_icmp_hdr>())).chksum as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(net_icmp_hdr),
            "::",
            stringify!(chksum)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct net_udp_hdr {
    pub src_port: u16_t,
    pub dst_port: u16_t,
    pub len: u16_t,
    pub chksum: u16_t,
}
#[test]
fn bindgen_test_layout_net_udp_hdr() {
    assert_eq!(
        ::core::mem::size_of::<net_udp_hdr>(),
        8usize,
        concat!("Size of: ", stringify!(net_udp_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<net_udp_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(net_udp_hdr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_udp_hdr>())).src_port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_udp_hdr),
            "::",
            stringify!(src_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_udp_hdr>())).dst_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(net_udp_hdr),
            "::",
            stringify!(dst_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_udp_hdr>())).len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(net_udp_hdr),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_udp_hdr>())).chksum as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(net_udp_hdr),
            "::",
            stringify!(chksum)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug)]
pub struct net_tcp_hdr {
    pub src_port: u16_t,
    pub dst_port: u16_t,
    pub seq: [u8_t; 4usize],
    pub ack: [u8_t; 4usize],
    pub offset: u8_t,
    pub flags: u8_t,
    pub wnd: [u8_t; 2usize],
    pub chksum: u16_t,
    pub urg: [u8_t; 2usize],
    pub optdata: __IncompleteArrayField<u8_t>,
}
#[test]
fn bindgen_test_layout_net_tcp_hdr() {
    assert_eq!(
        ::core::mem::size_of::<net_tcp_hdr>(),
        20usize,
        concat!("Size of: ", stringify!(net_tcp_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<net_tcp_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(net_tcp_hdr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).src_port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(src_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).dst_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(dst_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).seq as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).ack as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(ack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).offset as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).flags as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).wnd as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(wnd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).chksum as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(chksum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).urg as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(urg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_tcp_hdr>())).optdata as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(net_tcp_hdr),
            "::",
            stringify!(optdata)
        )
    );
}
extern "C" {
    #[doc = " @brief Check if this IPv6 address belongs to one of the interfaces."]
    #[doc = ""]
    #[doc = " @param addr IPv6 address"]
    #[doc = " @param iface Pointer to interface is returned"]
    #[doc = ""]
    #[doc = " @return Pointer to interface address, NULL if not found."]
    pub fn net_if_ipv6_addr_lookup(
        addr: *const in6_addr,
        iface: *mut *mut net_if,
    ) -> *mut net_if_addr;
}
extern "C" {
    #[doc = " @brief Check if this IPv6 multicast address belongs to a specific interface"]
    #[doc = " or one of the interfaces."]
    #[doc = ""]
    #[doc = " @param addr IPv6 address"]
    #[doc = " @param iface If *iface is null, then pointer to interface is returned,"]
    #[doc = " otherwise the *iface value needs to be matched."]
    #[doc = ""]
    #[doc = " @return Pointer to interface multicast address, NULL if not found."]
    pub fn net_if_ipv6_maddr_lookup(
        addr: *const in6_addr,
        iface: *mut *mut net_if,
    ) -> *mut net_if_mcast_addr;
}
extern "C" {
    #[doc = " @brief Return pointer to any (all bits zeros) IPv6 address."]
    #[doc = ""]
    #[doc = " @return Any IPv6 address."]
    pub fn net_ipv6_unspecified_address() -> *const in6_addr;
}
extern "C" {
    #[doc = " @brief Return pointer to any (all bits zeros) IPv4 address."]
    #[doc = ""]
    #[doc = " @return Any IPv4 address."]
    pub fn net_ipv4_unspecified_address() -> *const in_addr;
}
extern "C" {
    #[doc = " @brief Return pointer to broadcast (all bits ones) IPv4 address."]
    #[doc = ""]
    #[doc = " @return Broadcast IPv4 address."]
    pub fn net_ipv4_broadcast_address() -> *const in_addr;
}
extern "C" {
    #[doc = " @brief Check if the given IPv4 address belongs to local subnet."]
    #[doc = ""]
    #[doc = " @param iface Interface to use. Must be a valid pointer to an interface."]
    #[doc = " @param addr IPv4 address"]
    #[doc = ""]
    #[doc = " @return True if address is part of local subnet, false otherwise."]
    pub fn net_if_ipv4_addr_mask_cmp(iface: *mut net_if, addr: *const in_addr) -> bool;
}
extern "C" {
    #[doc = " @brief Check if the given IPv4 address is a broadcast address."]
    #[doc = ""]
    #[doc = " @param iface Interface to use. Must be a valid pointer to an interface."]
    #[doc = " @param addr IPv4 address, this should be in network byte order"]
    #[doc = ""]
    #[doc = " @return True if address is a broadcast address, false otherwise."]
    pub fn net_if_ipv4_is_addr_bcast(iface: *mut net_if, addr: *const in_addr) -> bool;
}
extern "C" {
    #[doc = " @brief Check if this IPv4 address belongs to one of the interfaces."]
    #[doc = ""]
    #[doc = " @param addr IPv4 address"]
    #[doc = " @param iface Interface is returned"]
    #[doc = ""]
    #[doc = " @return Pointer to interface address, NULL if not found."]
    pub fn net_if_ipv4_addr_lookup(
        addr: *const in_addr,
        iface: *mut *mut net_if,
    ) -> *mut net_if_addr;
}
extern "C" {
    #[doc = " @brief Convert a string to IP address."]
    #[doc = ""]
    #[doc = " @param family IP address family (AF_INET or AF_INET6)"]
    #[doc = " @param src IP address in a null terminated string"]
    #[doc = " @param dst Pointer to struct in_addr if family is AF_INET or"]
    #[doc = " pointer to struct in6_addr if family is AF_INET6"]
    #[doc = ""]
    #[doc = " @note This function doesn\'t do precise error checking,"]
    #[doc = " do not use for untrusted strings."]
    #[doc = ""]
    #[doc = " @return 0 if ok, < 0 if error"]
    pub fn net_addr_pton(
        family: sa_family_t,
        src: *const cty::c_char,
        dst: *mut cty::c_void,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Convert IP address to string form."]
    #[doc = ""]
    #[doc = " @param family IP address family (AF_INET or AF_INET6)"]
    #[doc = " @param src Pointer to struct in_addr if family is AF_INET or"]
    #[doc = "        pointer to struct in6_addr if family is AF_INET6"]
    #[doc = " @param dst Buffer for IP address as a null terminated string"]
    #[doc = " @param size Number of bytes available in the buffer"]
    #[doc = ""]
    #[doc = " @return dst pointer if ok, NULL if error"]
    pub fn net_addr_ntop(
        family: sa_family_t,
        src: *const cty::c_void,
        dst: *mut cty::c_char,
        size: usize,
    ) -> *mut cty::c_char;
}
extern "C" {
    #[doc = " @brief Parse a string that contains either IPv4 or IPv6 address"]
    #[doc = " and optional port, and store the information in user supplied"]
    #[doc = " sockaddr struct."]
    #[doc = ""]
    #[doc = " @details Syntax of the IP address string:"]
    #[doc = "   192.0.2.1:80"]
    #[doc = "   192.0.2.42"]
    #[doc = "   [2001:db8::1]:8080"]
    #[doc = "   [2001:db8::2]"]
    #[doc = "   2001:db::42"]
    #[doc = " Note that the str_len parameter is used to restrict the amount of"]
    #[doc = " characters that are checked. If the string does not contain port"]
    #[doc = " number, then the port number in sockaddr is not modified."]
    #[doc = ""]
    #[doc = " @param str String that contains the IP address."]
    #[doc = " @param str_len Length of the string to be parsed."]
    #[doc = " @param addr Pointer to user supplied struct sockaddr."]
    #[doc = ""]
    #[doc = " @return True if parsing could be done, false otherwise."]
    pub fn net_ipaddr_parse(str: *const cty::c_char, str_len: usize, addr: *mut sockaddr) -> bool;
}
extern "C" {
    #[doc = " @brief Convert a string of hex values to array of bytes."]
    #[doc = ""]
    #[doc = " @details The syntax of the string is \"ab:02:98:fa:42:01\""]
    #[doc = ""]
    #[doc = " @param buf Pointer to memory where the bytes are written."]
    #[doc = " @param buf_len Length of the memory area."]
    #[doc = " @param src String of bytes."]
    #[doc = ""]
    #[doc = " @return 0 if ok, <0 if error"]
    pub fn net_bytes_from_str(
        buf: *mut u8_t,
        buf_len: cty::c_int,
        src: *const cty::c_char,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Convert Tx network packet priority to traffic class so we can place"]
    #[doc = " the packet into correct Tx queue."]
    #[doc = ""]
    #[doc = " @param prio Network priority"]
    #[doc = ""]
    #[doc = " @return Tx traffic class that handles that priority network traffic."]
    pub fn net_tx_priority2tc(prio: net_priority) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Convert Rx network packet priority to traffic class so we can place"]
    #[doc = " the packet into correct Rx queue."]
    #[doc = ""]
    #[doc = " @param prio Network priority"]
    #[doc = ""]
    #[doc = " @return Rx traffic class that handles that priority network traffic."]
    pub fn net_rx_priority2tc(prio: net_priority) -> cty::c_int;
}
pub type atomic_t = cty::c_int;
pub type atomic_val_t = atomic_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _dnode {
    pub __bindgen_anon_1: _dnode__bindgen_ty_1,
    pub __bindgen_anon_2: _dnode__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _dnode__bindgen_ty_1 {
    pub head: *mut _dnode,
    pub next: *mut _dnode,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout__dnode__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<_dnode__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_dnode__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_dnode__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_dnode__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_dnode__bindgen_ty_1>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_1),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_dnode__bindgen_ty_1>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_1),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _dnode__bindgen_ty_2 {
    pub tail: *mut _dnode,
    pub prev: *mut _dnode,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout__dnode__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<_dnode__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(_dnode__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<_dnode__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(_dnode__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_dnode__bindgen_ty_2>())).tail as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_2),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_dnode__bindgen_ty_2>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_2),
            "::",
            stringify!(prev)
        )
    );
}
#[test]
fn bindgen_test_layout__dnode() {
    assert_eq!(
        ::core::mem::size_of::<_dnode>(),
        8usize,
        concat!("Size of: ", stringify!(_dnode))
    );
    assert_eq!(
        ::core::mem::align_of::<_dnode>(),
        4usize,
        concat!("Alignment of ", stringify!(_dnode))
    );
}
pub type sys_dlist_t = _dnode;
pub type sys_dnode_t = _dnode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rbnode {
    pub children: [*mut rbnode; 2usize],
}
#[test]
fn bindgen_test_layout_rbnode() {
    assert_eq!(
        ::core::mem::size_of::<rbnode>(),
        8usize,
        concat!("Size of: ", stringify!(rbnode))
    );
    assert_eq!(
        ::core::mem::align_of::<rbnode>(),
        4usize,
        concat!("Alignment of ", stringify!(rbnode))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rbnode>())).children as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rbnode),
            "::",
            stringify!(children)
        )
    );
}
#[doc = " @typedef rb_lessthan_t"]
#[doc = " @brief Red/black tree comparison predicate"]
#[doc = ""]
#[doc = " Compares the two nodes and returns true if node A is strictly less"]
#[doc = " than B according to the tree\'s sorting criteria, false otherwise."]
#[doc = ""]
#[doc = " Note that during insert, the new node being inserted will always be"]
#[doc = " \"A\", where \"B\" is the existing node within the tree against which"]
#[doc = " it is being compared.  This trait can be used (with care!) to"]
#[doc = " implement \"most/least recently added\" semantics between nodes which"]
#[doc = " would otherwise compare as equal."]
pub type rb_lessthan_t =
    ::core::option::Option<unsafe extern "C" fn(a: *mut rbnode, b: *mut rbnode) -> bool>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rbtree {
    pub root: *mut rbnode,
    pub lessthan_fn: rb_lessthan_t,
    pub max_depth: cty::c_int,
}
#[test]
fn bindgen_test_layout_rbtree() {
    assert_eq!(
        ::core::mem::size_of::<rbtree>(),
        12usize,
        concat!("Size of: ", stringify!(rbtree))
    );
    assert_eq!(
        ::core::mem::align_of::<rbtree>(),
        4usize,
        concat!("Alignment of ", stringify!(rbtree))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rbtree>())).root as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rbtree),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rbtree>())).lessthan_fn as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rbtree),
            "::",
            stringify!(lessthan_fn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rbtree>())).max_depth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rbtree),
            "::",
            stringify!(max_depth)
        )
    );
}
pub type rb_visit_t =
    ::core::option::Option<unsafe extern "C" fn(node: *mut rbnode, cookie: *mut cty::c_void)>;
extern "C" {
    pub fn _rb_child(node: *mut rbnode, side: cty::c_int) -> *mut rbnode;
}
extern "C" {
    pub fn _rb_is_black(node: *mut rbnode) -> cty::c_int;
}
extern "C" {
    pub fn _rb_walk(node: *mut rbnode, visit_fn: rb_visit_t, cookie: *mut cty::c_void);
}
extern "C" {
    pub fn _rb_get_minmax(tree: *mut rbtree, side: cty::c_int) -> *mut rbnode;
}
extern "C" {
    #[doc = " @brief Insert node into tree"]
    pub fn rb_insert(tree: *mut rbtree, node: *mut rbnode);
}
extern "C" {
    #[doc = " @brief Remove node from tree"]
    pub fn rb_remove(tree: *mut rbtree, node: *mut rbnode);
}
extern "C" {
    #[doc = " @brief Returns true if the given node is part of the tree"]
    #[doc = ""]
    #[doc = " Note that this does not internally dereference the node pointer"]
    #[doc = " (though the tree\'s lessthan callback might!), it just tests it for"]
    #[doc = " equality with items in the tree.  So it\'s feasible to use this to"]
    #[doc = " implement a \"set\" construct by simply testing the pointer value"]
    #[doc = " itself."]
    pub fn rb_contains(tree: *mut rbtree, node: *mut rbnode) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rb_foreach {
    pub stack: *mut *mut rbnode,
    pub is_left: *mut cty::c_char,
    pub top: cty::c_int,
}
#[test]
fn bindgen_test_layout__rb_foreach() {
    assert_eq!(
        ::core::mem::size_of::<_rb_foreach>(),
        12usize,
        concat!("Size of: ", stringify!(_rb_foreach))
    );
    assert_eq!(
        ::core::mem::align_of::<_rb_foreach>(),
        4usize,
        concat!("Alignment of ", stringify!(_rb_foreach))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_rb_foreach>())).stack as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_rb_foreach),
            "::",
            stringify!(stack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_rb_foreach>())).is_left as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_rb_foreach),
            "::",
            stringify!(is_left)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_rb_foreach>())).top as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_rb_foreach),
            "::",
            stringify!(top)
        )
    );
}
extern "C" {
    pub fn _rb_foreach_next(tree: *mut rbtree, f: *mut _rb_foreach) -> *mut rbnode;
}
extern "C" {
    pub fn _priq_dumb_best(pq: *mut sys_dlist_t) -> *mut k_thread;
}
extern "C" {
    pub fn _priq_dumb_remove(pq: *mut sys_dlist_t, thread: *mut k_thread);
}
extern "C" {
    pub fn _priq_dumb_add(pq: *mut sys_dlist_t, thread: *mut k_thread);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _priq_rb {
    pub tree: rbtree,
    pub next_order_key: cty::c_int,
}
#[test]
fn bindgen_test_layout__priq_rb() {
    assert_eq!(
        ::core::mem::size_of::<_priq_rb>(),
        16usize,
        concat!("Size of: ", stringify!(_priq_rb))
    );
    assert_eq!(
        ::core::mem::align_of::<_priq_rb>(),
        4usize,
        concat!("Alignment of ", stringify!(_priq_rb))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_priq_rb>())).tree as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_rb),
            "::",
            stringify!(tree)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_priq_rb>())).next_order_key as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_rb),
            "::",
            stringify!(next_order_key)
        )
    );
}
extern "C" {
    pub fn _priq_rb_add(pq: *mut _priq_rb, thread: *mut k_thread);
}
extern "C" {
    pub fn _priq_rb_remove(pq: *mut _priq_rb, thread: *mut k_thread);
}
extern "C" {
    pub fn _priq_rb_best(pq: *mut _priq_rb) -> *mut k_thread;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _priq_mq {
    pub queues: [sys_dlist_t; 32usize],
    pub bitmask: cty::c_uint,
}
#[test]
fn bindgen_test_layout__priq_mq() {
    assert_eq!(
        ::core::mem::size_of::<_priq_mq>(),
        260usize,
        concat!("Size of: ", stringify!(_priq_mq))
    );
    assert_eq!(
        ::core::mem::align_of::<_priq_mq>(),
        4usize,
        concat!("Alignment of ", stringify!(_priq_mq))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_priq_mq>())).queues as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_mq),
            "::",
            stringify!(queues)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_priq_mq>())).bitmask as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_mq),
            "::",
            stringify!(bitmask)
        )
    );
}
extern "C" {
    pub fn _priq_mq_add(pq: *mut _priq_mq, thread: *mut k_thread);
}
extern "C" {
    pub fn _priq_mq_remove(pq: *mut _priq_mq, thread: *mut k_thread);
}
extern "C" {
    pub fn _priq_mq_best(pq: *mut _priq_mq) -> *mut k_thread;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _snode {
    pub next: *mut _snode,
}
#[test]
fn bindgen_test_layout__snode() {
    assert_eq!(
        ::core::mem::size_of::<_snode>(),
        4usize,
        concat!("Size of: ", stringify!(_snode))
    );
    assert_eq!(
        ::core::mem::align_of::<_snode>(),
        4usize,
        concat!("Alignment of ", stringify!(_snode))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_snode>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_snode),
            "::",
            stringify!(next)
        )
    );
}
pub type sys_snode_t = _snode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _slist {
    pub head: *mut sys_snode_t,
    pub tail: *mut sys_snode_t,
}
#[test]
fn bindgen_test_layout__slist() {
    assert_eq!(
        ::core::mem::size_of::<_slist>(),
        8usize,
        concat!("Size of: ", stringify!(_slist))
    );
    assert_eq!(
        ::core::mem::align_of::<_slist>(),
        4usize,
        concat!("Alignment of ", stringify!(_slist))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_slist>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_slist),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_slist>())).tail as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_slist),
            "::",
            stringify!(tail)
        )
    );
}
pub type sys_slist_t = _slist;
pub type unative_t = u32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _sfnode {
    pub next_and_flags: unative_t,
}
#[test]
fn bindgen_test_layout__sfnode() {
    assert_eq!(
        ::core::mem::size_of::<_sfnode>(),
        4usize,
        concat!("Size of: ", stringify!(_sfnode))
    );
    assert_eq!(
        ::core::mem::align_of::<_sfnode>(),
        4usize,
        concat!("Alignment of ", stringify!(_sfnode))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_sfnode>())).next_and_flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_sfnode),
            "::",
            stringify!(next_and_flags)
        )
    );
}
pub type sys_sfnode_t = _sfnode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _sflist {
    pub head: *mut sys_sfnode_t,
    pub tail: *mut sys_sfnode_t,
}
#[test]
fn bindgen_test_layout__sflist() {
    assert_eq!(
        ::core::mem::size_of::<_sflist>(),
        8usize,
        concat!("Size of: ", stringify!(_sflist))
    );
    assert_eq!(
        ::core::mem::align_of::<_sflist>(),
        4usize,
        concat!("Alignment of ", stringify!(_sflist))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_sflist>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_sflist),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_sflist>())).tail as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_sflist),
            "::",
            stringify!(tail)
        )
    );
}
pub type sys_sflist_t = _sflist;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sys_mem_pool_lvl {
    pub __bindgen_anon_1: sys_mem_pool_lvl__bindgen_ty_1,
    pub free_list: sys_dlist_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sys_mem_pool_lvl__bindgen_ty_1 {
    pub bits_p: *mut u32_t,
    pub bits: u32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_sys_mem_pool_lvl__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<sys_mem_pool_lvl__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(sys_mem_pool_lvl__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<sys_mem_pool_lvl__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(sys_mem_pool_lvl__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<sys_mem_pool_lvl__bindgen_ty_1>())).bits_p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_lvl__bindgen_ty_1),
            "::",
            stringify!(bits_p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<sys_mem_pool_lvl__bindgen_ty_1>())).bits as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_lvl__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
}
#[test]
fn bindgen_test_layout_sys_mem_pool_lvl() {
    assert_eq!(
        ::core::mem::size_of::<sys_mem_pool_lvl>(),
        12usize,
        concat!("Size of: ", stringify!(sys_mem_pool_lvl))
    );
    assert_eq!(
        ::core::mem::align_of::<sys_mem_pool_lvl>(),
        4usize,
        concat!("Alignment of ", stringify!(sys_mem_pool_lvl))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sys_mem_pool_lvl>())).free_list as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_lvl),
            "::",
            stringify!(free_list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sys_mem_pool_base {
    pub buf: *mut cty::c_void,
    pub max_sz: usize,
    pub n_max: u16_t,
    pub n_levels: u8_t,
    pub max_inline_level: s8_t,
    pub levels: *mut sys_mem_pool_lvl,
    pub flags: u8_t,
}
#[test]
fn bindgen_test_layout_sys_mem_pool_base() {
    assert_eq!(
        ::core::mem::size_of::<sys_mem_pool_base>(),
        20usize,
        concat!("Size of: ", stringify!(sys_mem_pool_base))
    );
    assert_eq!(
        ::core::mem::align_of::<sys_mem_pool_base>(),
        4usize,
        concat!("Alignment of ", stringify!(sys_mem_pool_base))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sys_mem_pool_base>())).buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_base),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sys_mem_pool_base>())).max_sz as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_base),
            "::",
            stringify!(max_sz)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sys_mem_pool_base>())).n_max as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_base),
            "::",
            stringify!(n_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sys_mem_pool_base>())).n_levels as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_base),
            "::",
            stringify!(n_levels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<sys_mem_pool_base>())).max_inline_level as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_base),
            "::",
            stringify!(max_inline_level)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sys_mem_pool_base>())).levels as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_base),
            "::",
            stringify!(levels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sys_mem_pool_base>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_mem_pool_base),
            "::",
            stringify!(flags)
        )
    );
}
extern "C" {
    pub fn _sys_mem_pool_base_init(p: *mut sys_mem_pool_base);
}
extern "C" {
    pub fn _sys_mem_pool_block_alloc(
        p: *mut sys_mem_pool_base,
        size: usize,
        level_p: *mut u32_t,
        block_p: *mut u32_t,
        data_p: *mut *mut cty::c_void,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _sys_mem_pool_block_free(p: *mut sys_mem_pool_base, level: u32_t, block: u32_t);
}
extern "C" {
    pub fn sys_kernel_version_get() -> u32_t;
}
extern "C" {
    pub fn sys_rand32_get() -> u32_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _caller_saved {}
#[test]
fn bindgen_test_layout__caller_saved() {
    assert_eq!(
        ::core::mem::size_of::<_caller_saved>(),
        0usize,
        concat!("Size of: ", stringify!(_caller_saved))
    );
    assert_eq!(
        ::core::mem::align_of::<_caller_saved>(),
        1usize,
        concat!("Alignment of ", stringify!(_caller_saved))
    );
}
pub type _caller_saved_t = _caller_saved;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _callee_saved {
    pub v1: u32_t,
    pub v2: u32_t,
    pub v3: u32_t,
    pub v4: u32_t,
    pub v5: u32_t,
    pub v6: u32_t,
    pub v7: u32_t,
    pub v8: u32_t,
    pub psp: u32_t,
}
#[test]
fn bindgen_test_layout__callee_saved() {
    assert_eq!(
        ::core::mem::size_of::<_callee_saved>(),
        36usize,
        concat!("Size of: ", stringify!(_callee_saved))
    );
    assert_eq!(
        ::core::mem::align_of::<_callee_saved>(),
        4usize,
        concat!("Alignment of ", stringify!(_callee_saved))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_callee_saved>())).v1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_callee_saved>())).v2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_callee_saved>())).v3 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_callee_saved>())).v4 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_callee_saved>())).v5 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_callee_saved>())).v6 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_callee_saved>())).v7 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_callee_saved>())).v8 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_callee_saved>())).psp as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(psp)
        )
    );
}
pub type _callee_saved_t = _callee_saved;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _thread_arch {
    pub basepri: u32_t,
    pub swap_return_value: u32_t,
}
#[test]
fn bindgen_test_layout__thread_arch() {
    assert_eq!(
        ::core::mem::size_of::<_thread_arch>(),
        8usize,
        concat!("Size of: ", stringify!(_thread_arch))
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_arch>(),
        4usize,
        concat!("Alignment of ", stringify!(_thread_arch))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_thread_arch>())).basepri as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_arch),
            "::",
            stringify!(basepri)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_thread_arch>())).swap_return_value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_arch),
            "::",
            stringify!(swap_return_value)
        )
    );
}
pub type _thread_arch_t = _thread_arch;
extern "C" {
    pub fn printk(fmt: *const cty::c_char, ...);
}
extern "C" {
    pub fn vprintk(fmt: *const cty::c_char, ap: va_list);
}
extern "C" {
    pub fn snprintk(str: *mut cty::c_char, size: usize, fmt: *const cty::c_char, ...)
        -> cty::c_int;
}
extern "C" {
    pub fn vsnprintk(
        str: *mut cty::c_char,
        size: usize,
        fmt: *const cty::c_char,
        ap: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _vprintk(
        out: ::core::option::Option<
            unsafe extern "C" fn(arg1: cty::c_int, arg2: *mut cty::c_void) -> cty::c_int,
        >,
        ctx: *mut cty::c_void,
        fmt: *const cty::c_char,
        ap: va_list,
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __esf {
    pub __bindgen_anon_1: __esf__bindgen_ty_1,
    pub __bindgen_anon_2: __esf__bindgen_ty_2,
    pub __bindgen_anon_3: __esf__bindgen_ty_3,
    pub __bindgen_anon_4: __esf__bindgen_ty_4,
    pub __bindgen_anon_5: __esf__bindgen_ty_5,
    pub __bindgen_anon_6: __esf__bindgen_ty_6,
    pub __bindgen_anon_7: __esf__bindgen_ty_7,
    pub xpsr: u32_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf__bindgen_ty_1 {
    pub a1: u32_t,
    pub r0: u32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___esf__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__esf__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__esf__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_1>())).a1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_1),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_1>())).r0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_1),
            "::",
            stringify!(r0)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf__bindgen_ty_2 {
    pub a2: u32_t,
    pub r1: u32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___esf__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<__esf__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(__esf__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_2>())).a2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_2),
            "::",
            stringify!(a2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_2>())).r1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_2),
            "::",
            stringify!(r1)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf__bindgen_ty_3 {
    pub a3: u32_t,
    pub r2: u32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___esf__bindgen_ty_3() {
    assert_eq!(
        ::core::mem::size_of::<__esf__bindgen_ty_3>(),
        4usize,
        concat!("Size of: ", stringify!(__esf__bindgen_ty_3))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_3>())).a3 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_3),
            "::",
            stringify!(a3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_3>())).r2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_3),
            "::",
            stringify!(r2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf__bindgen_ty_4 {
    pub a4: u32_t,
    pub r3: u32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___esf__bindgen_ty_4() {
    assert_eq!(
        ::core::mem::size_of::<__esf__bindgen_ty_4>(),
        4usize,
        concat!("Size of: ", stringify!(__esf__bindgen_ty_4))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf__bindgen_ty_4>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf__bindgen_ty_4))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_4>())).a4 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_4),
            "::",
            stringify!(a4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_4>())).r3 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_4),
            "::",
            stringify!(r3)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf__bindgen_ty_5 {
    pub ip: u32_t,
    pub r12: u32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___esf__bindgen_ty_5() {
    assert_eq!(
        ::core::mem::size_of::<__esf__bindgen_ty_5>(),
        4usize,
        concat!("Size of: ", stringify!(__esf__bindgen_ty_5))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf__bindgen_ty_5>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf__bindgen_ty_5))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_5>())).ip as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_5),
            "::",
            stringify!(ip)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_5>())).r12 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_5),
            "::",
            stringify!(r12)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf__bindgen_ty_6 {
    pub lr: u32_t,
    pub r14: u32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___esf__bindgen_ty_6() {
    assert_eq!(
        ::core::mem::size_of::<__esf__bindgen_ty_6>(),
        4usize,
        concat!("Size of: ", stringify!(__esf__bindgen_ty_6))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf__bindgen_ty_6>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf__bindgen_ty_6))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_6>())).lr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_6),
            "::",
            stringify!(lr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_6>())).r14 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_6),
            "::",
            stringify!(r14)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf__bindgen_ty_7 {
    pub pc: u32_t,
    pub r15: u32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___esf__bindgen_ty_7() {
    assert_eq!(
        ::core::mem::size_of::<__esf__bindgen_ty_7>(),
        4usize,
        concat!("Size of: ", stringify!(__esf__bindgen_ty_7))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf__bindgen_ty_7>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf__bindgen_ty_7))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_7>())).pc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_7),
            "::",
            stringify!(pc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf__bindgen_ty_7>())).r15 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf__bindgen_ty_7),
            "::",
            stringify!(r15)
        )
    );
}
#[test]
fn bindgen_test_layout___esf() {
    assert_eq!(
        ::core::mem::size_of::<__esf>(),
        32usize,
        concat!("Size of: ", stringify!(__esf))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__esf>())).xpsr as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(xpsr)
        )
    );
}
pub type NANO_ESF = __esf;
extern "C" {
    pub fn _ExcExit();
}
extern "C" {
    #[doc = " @brief display the contents of a exception stack frame"]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn sys_exc_esf_dump(esf: *mut NANO_ESF);
}
extern "C" {
    #[doc = " Configure a dynamic interrupt."]
    #[doc = ""]
    #[doc = " Use this instead of IRQ_CONNECT() if arguments cannot be known at build time."]
    #[doc = ""]
    #[doc = " @param irq IRQ line number"]
    #[doc = " @param priority Interrupt priority"]
    #[doc = " @param routine Interrupt service routine"]
    #[doc = " @param parameter ISR parameter"]
    #[doc = " @param flags Arch-specific IRQ configuration flags"]
    #[doc = ""]
    #[doc = " @return The vector assigned to this interrupt"]
    pub fn _arch_irq_connect_dynamic(
        irq: cty::c_uint,
        priority: cty::c_uint,
        routine: ::core::option::Option<unsafe extern "C" fn(parameter: *mut cty::c_void)>,
        parameter: *mut cty::c_void,
        flags: u32_t,
    ) -> cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _isr_table_entry {
    pub arg: *mut cty::c_void,
    pub isr: ::core::option::Option<unsafe extern "C" fn(arg1: *mut cty::c_void)>,
}
#[test]
fn bindgen_test_layout__isr_table_entry() {
    assert_eq!(
        ::core::mem::size_of::<_isr_table_entry>(),
        8usize,
        concat!("Size of: ", stringify!(_isr_table_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<_isr_table_entry>(),
        4usize,
        concat!("Alignment of ", stringify!(_isr_table_entry))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_isr_table_entry>())).arg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_table_entry),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_isr_table_entry>())).isr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_table_entry),
            "::",
            stringify!(isr)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_sw_isr_table"]
    pub static mut _sw_isr_table: [_isr_table_entry; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _isr_list {
    #[doc = " IRQ line number"]
    pub irq: s32_t,
    #[doc = " Flags for this IRQ, see ISR_FLAG_* definitions"]
    pub flags: s32_t,
    #[doc = " ISR to call"]
    pub func: *mut cty::c_void,
    #[doc = " Parameter for non-direct IRQs"]
    pub param: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout__isr_list() {
    assert_eq!(
        ::core::mem::size_of::<_isr_list>(),
        16usize,
        concat!("Size of: ", stringify!(_isr_list))
    );
    assert_eq!(
        ::core::mem::align_of::<_isr_list>(),
        4usize,
        concat!("Alignment of ", stringify!(_isr_list))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_isr_list>())).irq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(irq)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_isr_list>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_isr_list>())).func as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_isr_list>())).param as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(param)
        )
    );
}
extern "C" {
    pub fn _arch_irq_enable(irq: cty::c_uint);
}
extern "C" {
    pub fn _arch_irq_disable(irq: cty::c_uint);
}
extern "C" {
    pub fn _arch_irq_is_enabled(irq: cty::c_uint) -> cty::c_int;
}
extern "C" {
    pub fn _IntExit();
}
extern "C" {
    pub fn _irq_priority_set(irq: cty::c_uint, prio: cty::c_uint, flags: u32_t);
}
extern "C" {
    pub fn _arch_isr_direct_header();
}
extern "C" {
    pub fn _irq_spurious(unused: *mut cty::c_void);
}
extern "C" {
    pub fn _isr_wrapper();
}
extern "C" {
    pub fn _NanoFatalErrorHandler(reason: cty::c_uint, esf: *const NANO_ESF);
}
extern "C" {
    pub fn _SysFatalErrorHandler(reason: cty::c_uint, esf: *const NANO_ESF);
}
extern "C" {
    #[doc = " @brief Make the CPU idle."]
    #[doc = ""]
    #[doc = " This function makes the CPU idle until an event wakes it up."]
    #[doc = ""]
    #[doc = " In a regular system, the idle thread should be the only thread responsible"]
    #[doc = " for making the CPU idle and triggering any type of power management."]
    #[doc = " However, in some more constrained systems, such as a single-threaded system,"]
    #[doc = " the only thread would be responsible for this if needed."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MISC-001"]
    pub fn k_cpu_idle();
}
extern "C" {
    pub fn _timer_cycle_get_32() -> u32_t;
}
pub type paddr_t = cty::c_uint;
pub type vaddr_t = cty::c_uint;
pub type io_port_t = u32_t;
pub type mm_reg_t = u32_t;
pub type mem_addr_t = u32_t;
pub type k_mem_partition_attr_t = u32_t;
extern "C" {
    #[link_name = "\u{1}_sys_clock_always_on"]
    pub static mut _sys_clock_always_on: cty::c_int;
}
extern "C" {
    pub fn _enable_sys_clock();
}
extern "C" {
    #[doc = " @brief Return the lower part of the current system tick count"]
    #[doc = ""]
    #[doc = " @return the current system tick count"]
    #[doc = ""]
    pub fn z_tick_get_32() -> u32_t;
}
extern "C" {
    #[doc = " @brief Return the current system tick count"]
    #[doc = ""]
    #[doc = " @return the current system tick count"]
    #[doc = ""]
    pub fn z_tick_get() -> s64_t;
}
pub type _timeout_func_t = ::core::option::Option<unsafe extern "C" fn(t: *mut _timeout)>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _timeout {
    pub node: sys_dnode_t,
    pub dticks: s32_t,
    pub fn_: _timeout_func_t,
}
#[test]
fn bindgen_test_layout__timeout() {
    assert_eq!(
        ::core::mem::size_of::<_timeout>(),
        16usize,
        concat!("Size of: ", stringify!(_timeout))
    );
    assert_eq!(
        ::core::mem::align_of::<_timeout>(),
        4usize,
        concat!("Alignment of ", stringify!(_timeout))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_timeout>())).node as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_timeout),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_timeout>())).dticks as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_timeout),
            "::",
            stringify!(dticks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_timeout>())).fn_ as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_timeout),
            "::",
            stringify!(fn_)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _wait_q_t {
    pub waitq: sys_dlist_t,
}
#[test]
fn bindgen_test_layout__wait_q_t() {
    assert_eq!(
        ::core::mem::size_of::<_wait_q_t>(),
        8usize,
        concat!("Size of: ", stringify!(_wait_q_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_wait_q_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_wait_q_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_wait_q_t>())).waitq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_wait_q_t),
            "::",
            stringify!(waitq)
        )
    );
}
pub const k_objects_K_OBJ_ANY: k_objects = 0;
pub const k_objects_K_OBJ_POLL_SIGNAL: k_objects = 1;
pub const k_objects_K_OBJ_NET_CONTEXT: k_objects = 2;
pub const k_objects_K_OBJ_MSGQ: k_objects = 3;
pub const k_objects_K_OBJ_TIMER: k_objects = 4;
pub const k_objects_K_OBJ_ALERT: k_objects = 5;
pub const k_objects_K_OBJ_PIPE: k_objects = 6;
pub const k_objects_K_OBJ_QUEUE: k_objects = 7;
pub const k_objects_K_OBJ_MUTEX: k_objects = 8;
pub const k_objects_K_OBJ_STACK: k_objects = 9;
pub const k_objects_K_OBJ_MEM_SLAB: k_objects = 10;
pub const k_objects_K_OBJ_THREAD: k_objects = 11;
pub const k_objects_K_OBJ__THREAD_STACK_ELEMENT: k_objects = 12;
pub const k_objects_K_OBJ_SEM: k_objects = 13;
pub const k_objects_K_OBJ_DRIVER_ADC: k_objects = 14;
pub const k_objects_K_OBJ_DRIVER_AIO_CMP: k_objects = 15;
pub const k_objects_K_OBJ_DRIVER_COUNTER: k_objects = 16;
pub const k_objects_K_OBJ_DRIVER_CRYPTO: k_objects = 17;
pub const k_objects_K_OBJ_DRIVER_DMA: k_objects = 18;
pub const k_objects_K_OBJ_DRIVER_FLASH: k_objects = 19;
pub const k_objects_K_OBJ_DRIVER_GPIO: k_objects = 20;
pub const k_objects_K_OBJ_DRIVER_I2C: k_objects = 21;
pub const k_objects_K_OBJ_DRIVER_I2S: k_objects = 22;
pub const k_objects_K_OBJ_DRIVER_IPM: k_objects = 23;
pub const k_objects_K_OBJ_DRIVER_LED: k_objects = 24;
pub const k_objects_K_OBJ_DRIVER_PINMUX: k_objects = 25;
pub const k_objects_K_OBJ_DRIVER_PWM: k_objects = 26;
pub const k_objects_K_OBJ_DRIVER_ENTROPY: k_objects = 27;
pub const k_objects_K_OBJ_DRIVER_RTC: k_objects = 28;
pub const k_objects_K_OBJ_DRIVER_SENSOR: k_objects = 29;
pub const k_objects_K_OBJ_DRIVER_SPI: k_objects = 30;
pub const k_objects_K_OBJ_DRIVER_UART: k_objects = 31;
#[doc = " @endcond"]
pub const k_objects_K_OBJ_LAST: k_objects = 32;
pub type k_objects = u32;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _k_thread_stack_element {
    pub data: cty::c_char,
}
#[test]
fn bindgen_test_layout__k_thread_stack_element() {
    assert_eq!(
        ::core::mem::size_of::<_k_thread_stack_element>(),
        1usize,
        concat!("Size of: ", stringify!(_k_thread_stack_element))
    );
    assert_eq!(
        ::core::mem::align_of::<_k_thread_stack_element>(),
        1usize,
        concat!("Alignment of ", stringify!(_k_thread_stack_element))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_k_thread_stack_element>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_k_thread_stack_element),
            "::",
            stringify!(data)
        )
    );
}
pub type k_thread_stack_t = _k_thread_stack_element;
#[doc = " @typedef k_thread_entry_t"]
#[doc = " @brief Thread entry point function type."]
#[doc = ""]
#[doc = " A thread\'s entry point function is invoked when the thread starts executing."]
#[doc = " Up to 3 argument values can be passed to the function."]
#[doc = ""]
#[doc = " The thread terminates execution permanently if the entry point function"]
#[doc = " returns. The thread is responsible for releasing any shared resources"]
#[doc = " it may own (such as mutexes and dynamically allocated memory), prior to"]
#[doc = " returning."]
#[doc = ""]
#[doc = " @param p1 First argument."]
#[doc = " @param p2 Second argument."]
#[doc = " @param p3 Third argument."]
#[doc = ""]
#[doc = " @return N/A"]
pub type k_thread_entry_t = ::core::option::Option<
    unsafe extern "C" fn(p1: *mut cty::c_void, p2: *mut cty::c_void, p3: *mut cty::c_void),
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _thread_base {
    pub __bindgen_anon_1: _thread_base__bindgen_ty_1,
    pub pended_on: *mut _wait_q_t,
    pub user_options: u8_t,
    pub thread_state: u8_t,
    pub __bindgen_anon_2: _thread_base__bindgen_ty_2,
    pub order_key: u32_t,
    pub swap_data: *mut cty::c_void,
    pub timeout: _timeout,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _thread_base__bindgen_ty_1 {
    pub qnode_dlist: sys_dlist_t,
    pub qnode_rb: rbnode,
    _bindgen_union_align: [u32; 2usize],
}
#[test]
fn bindgen_test_layout__thread_base__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<_thread_base__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_thread_base__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_base__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_thread_base__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_thread_base__bindgen_ty_1>())).qnode_dlist as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_1),
            "::",
            stringify!(qnode_dlist)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_thread_base__bindgen_ty_1>())).qnode_rb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_1),
            "::",
            stringify!(qnode_rb)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _thread_base__bindgen_ty_2 {
    pub __bindgen_anon_1: _thread_base__bindgen_ty_2__bindgen_ty_1,
    pub preempt: u16_t,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _thread_base__bindgen_ty_2__bindgen_ty_1 {
    pub prio: s8_t,
    pub sched_locked: u8_t,
}
#[test]
fn bindgen_test_layout__thread_base__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<_thread_base__bindgen_ty_2__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(_thread_base__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_base__bindgen_ty_2__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_thread_base__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_thread_base__bindgen_ty_2__bindgen_ty_1>())).prio as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(prio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_thread_base__bindgen_ty_2__bindgen_ty_1>())).sched_locked
                as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(sched_locked)
        )
    );
}
#[test]
fn bindgen_test_layout__thread_base__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<_thread_base__bindgen_ty_2>(),
        2usize,
        concat!("Size of: ", stringify!(_thread_base__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_base__bindgen_ty_2>(),
        2usize,
        concat!("Alignment of ", stringify!(_thread_base__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_thread_base__bindgen_ty_2>())).preempt as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_2),
            "::",
            stringify!(preempt)
        )
    );
}
#[test]
fn bindgen_test_layout__thread_base() {
    assert_eq!(
        ::core::mem::size_of::<_thread_base>(),
        40usize,
        concat!("Size of: ", stringify!(_thread_base))
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_base>(),
        4usize,
        concat!("Alignment of ", stringify!(_thread_base))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_thread_base>())).pended_on as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(pended_on)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_thread_base>())).user_options as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(user_options)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_thread_base>())).thread_state as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(thread_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_thread_base>())).order_key as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(order_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_thread_base>())).swap_data as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(swap_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_thread_base>())).timeout as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(timeout)
        )
    );
}
pub type _thread_base_t = _thread_base;
#[doc = " @ingroup thread_apis"]
#[doc = " Thread Structure"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_thread {
    pub base: _thread_base,
    #[doc = " defined by the architecture, but all archs need these"]
    pub caller_saved: _caller_saved,
    #[doc = " defined by the architecture, but all archs need these"]
    pub callee_saved: _callee_saved,
    #[doc = " static thread init data"]
    pub init_data: *mut cty::c_void,
    #[doc = " abort function"]
    #[doc = " @req K-THREAD-002"]
    pub fn_abort: ::core::option::Option<unsafe extern "C" fn()>,
    #[doc = " per-thread errno variable"]
    pub errno_var: cty::c_int,
    #[doc = " resource pool"]
    pub resource_pool: *mut k_mem_pool,
    #[doc = " arch-specifics: must always be at the end"]
    pub arch: _thread_arch,
}
#[test]
fn bindgen_test_layout_k_thread() {
    assert_eq!(
        ::core::mem::size_of::<k_thread>(),
        100usize,
        concat!("Size of: ", stringify!(k_thread))
    );
    assert_eq!(
        ::core::mem::align_of::<k_thread>(),
        4usize,
        concat!("Alignment of ", stringify!(k_thread))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_thread>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_thread>())).caller_saved as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(caller_saved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_thread>())).callee_saved as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(callee_saved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_thread>())).init_data as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(init_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_thread>())).fn_abort as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(fn_abort)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_thread>())).errno_var as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(errno_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_thread>())).resource_pool as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(resource_pool)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_thread>())).arch as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(arch)
        )
    );
}
pub type _thread_t = k_thread;
pub type k_tid_t = *mut k_thread;
pub const execution_context_types_K_ISR: execution_context_types = 0;
pub const execution_context_types_K_COOP_THREAD: execution_context_types = 1;
pub const execution_context_types_K_PREEMPT_THREAD: execution_context_types = 2;
pub type execution_context_types = u32;
#[doc = " @defgroup profiling_apis Profiling APIs"]
#[doc = " @ingroup kernel_apis"]
#[doc = " @{"]
pub type k_thread_user_cb_t = ::core::option::Option<
    unsafe extern "C" fn(thread: *const k_thread, user_data: *mut cty::c_void),
>;
extern "C" {
    #[doc = " @brief Iterate over all the threads in the system."]
    #[doc = ""]
    #[doc = " This routine iterates over all the threads in the system and"]
    #[doc = " calls the user_cb function for each thread."]
    #[doc = ""]
    #[doc = " @param user_cb Pointer to the user callback function."]
    #[doc = " @param user_data Pointer to user data."]
    #[doc = ""]
    #[doc = " @note CONFIG_THREAD_MONITOR must be set for this function"]
    #[doc = " to be effective. Also this API uses irq_lock to protect the"]
    #[doc = " _kernel.threads list which means creation of new threads and"]
    #[doc = " terminations of existing threads are blocked until this"]
    #[doc = " API returns."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_thread_foreach(user_cb: k_thread_user_cb_t, user_data: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Drop a thread\'s privileges permanently to user mode"]
    #[doc = ""]
    #[doc = " @param entry Function to start executing from"]
    #[doc = " @param p1 1st entry point parameter"]
    #[doc = " @param p2 2nd entry point parameter"]
    #[doc = " @param p3 3rd entry point parameter"]
    #[doc = " @req K-THREAD-003"]
    pub fn k_thread_user_mode_enter(
        entry: k_thread_entry_t,
        p1: *mut cty::c_void,
        p2: *mut cty::c_void,
        p3: *mut cty::c_void,
    );
}
extern "C" {
    #[doc = " @brief Grant a thread access to a NULL-terminated  set of kernel objects"]
    #[doc = ""]
    #[doc = " This is a convenience function. For the provided thread, grant access to"]
    #[doc = " the remaining arguments, which must be pointers to kernel objects."]
    #[doc = " The final argument must be a NULL."]
    #[doc = ""]
    #[doc = " The thread object must be initialized (i.e. running). The objects don\'t"]
    #[doc = " need to be."]
    #[doc = ""]
    #[doc = " @param thread Thread to grant access to objects"]
    #[doc = " @param ... NULL-terminated list of kernel object pointers"]
    #[doc = " @req K-THREAD-004"]
    pub fn k_thread_access_grant(thread: *mut k_thread, ...);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _static_thread_data {
    pub init_thread: *mut k_thread,
    pub init_stack: *mut k_thread_stack_t,
    pub init_stack_size: cty::c_uint,
    pub init_entry: k_thread_entry_t,
    pub init_p1: *mut cty::c_void,
    pub init_p2: *mut cty::c_void,
    pub init_p3: *mut cty::c_void,
    pub init_prio: cty::c_int,
    pub init_options: u32_t,
    pub init_delay: s32_t,
    pub init_abort: ::core::option::Option<unsafe extern "C" fn()>,
    pub init_name: *const cty::c_char,
}
#[test]
fn bindgen_test_layout__static_thread_data() {
    assert_eq!(
        ::core::mem::size_of::<_static_thread_data>(),
        48usize,
        concat!("Size of: ", stringify!(_static_thread_data))
    );
    assert_eq!(
        ::core::mem::align_of::<_static_thread_data>(),
        4usize,
        concat!("Alignment of ", stringify!(_static_thread_data))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_static_thread_data>())).init_thread as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_thread)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_static_thread_data>())).init_stack as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_static_thread_data>())).init_stack_size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_stack_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_static_thread_data>())).init_entry as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_entry)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_static_thread_data>())).init_p1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_p1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_static_thread_data>())).init_p2 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_p2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_static_thread_data>())).init_p3 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_p3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_static_thread_data>())).init_prio as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_prio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_static_thread_data>())).init_options as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_options)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_static_thread_data>())).init_delay as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_delay)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_static_thread_data>())).init_abort as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_abort)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_static_thread_data>())).init_name as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_name)
        )
    );
}
extern "C" {
    #[doc = " @brief Set time-slicing period and scope."]
    #[doc = ""]
    #[doc = " This routine specifies how the scheduler will perform time slicing of"]
    #[doc = " preemptible threads."]
    #[doc = ""]
    #[doc = " To enable time slicing, @a slice must be non-zero. The scheduler"]
    #[doc = " ensures that no thread runs for more than the specified time limit"]
    #[doc = " before other threads of that priority are given a chance to execute."]
    #[doc = " Any thread whose priority is higher than @a prio is exempted, and may"]
    #[doc = " execute as long as desired without being preempted due to time slicing."]
    #[doc = ""]
    #[doc = " Time slicing only limits the maximum amount of time a thread may continuously"]
    #[doc = " execute. Once the scheduler selects a thread for execution, there is no"]
    #[doc = " minimum guaranteed time the thread will execute before threads of greater or"]
    #[doc = " equal priority are scheduled."]
    #[doc = ""]
    #[doc = " When the current thread is the only one of that priority eligible"]
    #[doc = " for execution, this routine has no effect; the thread is immediately"]
    #[doc = " rescheduled after the slice period expires."]
    #[doc = ""]
    #[doc = " To disable timeslicing, set both @a slice and @a prio to zero."]
    #[doc = ""]
    #[doc = " @param slice Maximum time slice length (in milliseconds)."]
    #[doc = " @param prio Highest thread priority level eligible for time slicing."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_sched_time_slice_set(slice: s32_t, prio: cty::c_int);
}
extern "C" {
    #[doc = " @brief Determine if code is running at interrupt level."]
    #[doc = ""]
    #[doc = " This routine allows the caller to customize its actions, depending on"]
    #[doc = " whether it is a thread or an ISR."]
    #[doc = ""]
    #[doc = " @note Can be called by ISRs."]
    #[doc = ""]
    #[doc = " @return 0 if invoked by a thread."]
    #[doc = " @return Non-zero if invoked by an ISR."]
    pub fn k_is_in_isr() -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Lock the scheduler."]
    #[doc = ""]
    #[doc = " This routine prevents the current thread from being preempted by another"]
    #[doc = " thread by instructing the scheduler to treat it as a cooperative thread."]
    #[doc = " If the thread subsequently performs an operation that makes it unready,"]
    #[doc = " it will be context switched out in the normal manner. When the thread"]
    #[doc = " again becomes the current thread, its non-preemptible status is maintained."]
    #[doc = ""]
    #[doc = " This routine can be called recursively."]
    #[doc = ""]
    #[doc = " @note k_sched_lock() and k_sched_unlock() should normally be used"]
    #[doc = " when the operation being performed can be safely interrupted by ISRs."]
    #[doc = " However, if the amount of processing involved is very small, better"]
    #[doc = " performance may be obtained by using irq_lock() and irq_unlock()."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_sched_lock();
}
extern "C" {
    #[doc = " @brief Unlock the scheduler."]
    #[doc = ""]
    #[doc = " This routine reverses the effect of a previous call to k_sched_lock()."]
    #[doc = " A thread must call the routine once for each time it called k_sched_lock()"]
    #[doc = " before the thread becomes preemptible."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_sched_unlock();
}
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
pub struct k_timer {
    pub timeout: _timeout,
    pub wait_q: _wait_q_t,
    pub expiry_fn: ::core::option::Option<unsafe extern "C" fn(arg1: *mut k_timer)>,
    pub stop_fn: ::core::option::Option<unsafe extern "C" fn(arg1: *mut k_timer)>,
    pub period: s32_t,
    pub status: u32_t,
    pub user_data: *mut cty::c_void,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
}
#[test]
fn bindgen_test_layout_k_timer() {
    assert_eq!(
        ::core::mem::size_of::<k_timer>(),
        44usize,
        concat!("Size of: ", stringify!(k_timer))
    );
    assert_eq!(
        ::core::mem::align_of::<k_timer>(),
        4usize,
        concat!("Alignment of ", stringify!(k_timer))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_timer>())).timeout as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_timer>())).wait_q as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(wait_q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_timer>())).expiry_fn as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(expiry_fn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_timer>())).stop_fn as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(stop_fn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_timer>())).period as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(period)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_timer>())).status as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_timer>())).user_data as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(user_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_timer>())).__dummy_next as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(__dummy_next)
        )
    );
}
#[doc = " @typedef k_timer_expiry_t"]
#[doc = " @brief Timer expiry function type."]
#[doc = ""]
#[doc = " A timer\'s expiry function is executed by the system clock interrupt handler"]
#[doc = " each time the timer expires. The expiry function is optional, and is only"]
#[doc = " invoked if the timer has been initialized with one."]
#[doc = ""]
#[doc = " @param timer     Address of timer."]
#[doc = ""]
#[doc = " @return N/A"]
pub type k_timer_expiry_t = ::core::option::Option<unsafe extern "C" fn(timer: *mut k_timer)>;
#[doc = " @typedef k_timer_stop_t"]
#[doc = " @brief Timer stop function type."]
#[doc = ""]
#[doc = " A timer\'s stop function is executed if the timer is stopped prematurely."]
#[doc = " The function runs in the context of the thread that stops the timer."]
#[doc = " The stop function is optional, and is only invoked if the timer has been"]
#[doc = " initialized with one."]
#[doc = ""]
#[doc = " @param timer     Address of timer."]
#[doc = ""]
#[doc = " @return N/A"]
pub type k_timer_stop_t = ::core::option::Option<unsafe extern "C" fn(timer: *mut k_timer)>;
extern "C" {
    #[doc = " @brief Initialize a timer."]
    #[doc = ""]
    #[doc = " This routine initializes a timer, prior to its first use."]
    #[doc = ""]
    #[doc = " @param timer     Address of timer."]
    #[doc = " @param expiry_fn Function to invoke each time the timer expires."]
    #[doc = " @param stop_fn   Function to invoke if the timer is stopped while running."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_timer_init(timer: *mut k_timer, expiry_fn: k_timer_expiry_t, stop_fn: k_timer_stop_t);
}
extern "C" {
    pub fn z_timeout_remaining(timeout: *mut _timeout) -> s32_t;
}
extern "C" {
    #[doc = " @brief Enable clock always on in tickless kernel"]
    #[doc = ""]
    #[doc = " This routine enables keeping the clock running (that is, it always"]
    #[doc = " keeps an active timer interrupt scheduled) when there are no timer"]
    #[doc = " events programmed in tickless kernel scheduling. This is necessary"]
    #[doc = " if the clock is used to track passage of time (e.g. via"]
    #[doc = " k_uptime_get_32()), otherwise the internal hardware counter may"]
    #[doc = " roll over between interrupts."]
    #[doc = ""]
    #[doc = " @retval prev_status Previous status of always on flag"]
    pub fn k_enable_sys_clock_always_on() -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Disable clock always on in tickless kernel"]
    #[doc = ""]
    #[doc = " This routine disables keeping the clock running when"]
    #[doc = " there are no timer events programmed in tickless kernel"]
    #[doc = " scheduling. To save power, this routine should be called"]
    #[doc = " immediately when clock is not used to track time."]
    pub fn k_disable_sys_clock_always_on();
}
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
pub struct k_queue {
    pub data_q: sys_sflist_t,
    pub __bindgen_anon_1: k_queue__bindgen_ty_1,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union k_queue__bindgen_ty_1 {
    pub wait_q: _wait_q_t,
    pub poll_events: sys_dlist_t,
    _bindgen_union_align: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_k_queue__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<k_queue__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(k_queue__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<k_queue__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(k_queue__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_queue__bindgen_ty_1>())).wait_q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_queue__bindgen_ty_1),
            "::",
            stringify!(wait_q)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<k_queue__bindgen_ty_1>())).poll_events as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_queue__bindgen_ty_1),
            "::",
            stringify!(poll_events)
        )
    );
}
#[test]
fn bindgen_test_layout_k_queue() {
    assert_eq!(
        ::core::mem::size_of::<k_queue>(),
        16usize,
        concat!("Size of: ", stringify!(k_queue))
    );
    assert_eq!(
        ::core::mem::align_of::<k_queue>(),
        4usize,
        concat!("Alignment of ", stringify!(k_queue))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_queue>())).data_q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_queue),
            "::",
            stringify!(data_q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_queue>())).__dummy_next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_queue),
            "::",
            stringify!(__dummy_next)
        )
    );
}
extern "C" {
    pub fn z_queue_node_peek(node: *mut sys_sfnode_t, needs_free: bool) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " @brief Append an element to the end of a queue."]
    #[doc = ""]
    #[doc = " This routine appends a data item to @a queue. A queue data item must be"]
    #[doc = " aligned on a 4-byte boundary, and the first 32 bits of the item are"]
    #[doc = " reserved for the kernel\'s use."]
    #[doc = ""]
    #[doc = " @note Can be called by ISRs."]
    #[doc = ""]
    #[doc = " @param queue Address of the queue."]
    #[doc = " @param data Address of the data item."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_queue_append(queue: *mut k_queue, data: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Prepend an element to a queue."]
    #[doc = ""]
    #[doc = " This routine prepends a data item to @a queue. A queue data item must be"]
    #[doc = " aligned on a 4-byte boundary, and the first 32 bits of the item are"]
    #[doc = " reserved for the kernel\'s use."]
    #[doc = ""]
    #[doc = " @note Can be called by ISRs."]
    #[doc = ""]
    #[doc = " @param queue Address of the queue."]
    #[doc = " @param data Address of the data item."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_queue_prepend(queue: *mut k_queue, data: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Inserts an element to a queue."]
    #[doc = ""]
    #[doc = " This routine inserts a data item to @a queue after previous item. A queue"]
    #[doc = " data item must be aligned on a 4-byte boundary, and the first 32 bits of the"]
    #[doc = " item are reserved for the kernel\'s use."]
    #[doc = ""]
    #[doc = " @note Can be called by ISRs."]
    #[doc = ""]
    #[doc = " @param queue Address of the queue."]
    #[doc = " @param prev Address of the previous data item."]
    #[doc = " @param data Address of the data item."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_queue_insert(queue: *mut k_queue, prev: *mut cty::c_void, data: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Atomically append a list of elements to a queue."]
    #[doc = ""]
    #[doc = " This routine adds a list of data items to @a queue in one operation."]
    #[doc = " The data items must be in a singly-linked list, with the first 32 bits"]
    #[doc = " in each data item pointing to the next data item; the list must be"]
    #[doc = " NULL-terminated."]
    #[doc = ""]
    #[doc = " @note Can be called by ISRs."]
    #[doc = ""]
    #[doc = " @param queue Address of the queue."]
    #[doc = " @param head Pointer to first node in singly-linked list."]
    #[doc = " @param tail Pointer to last node in singly-linked list."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_queue_append_list(queue: *mut k_queue, head: *mut cty::c_void, tail: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Atomically add a list of elements to a queue."]
    #[doc = ""]
    #[doc = " This routine adds a list of data items to @a queue in one operation."]
    #[doc = " The data items must be in a singly-linked list implemented using a"]
    #[doc = " sys_slist_t object. Upon completion, the original list is empty."]
    #[doc = ""]
    #[doc = " @note Can be called by ISRs."]
    #[doc = ""]
    #[doc = " @param queue Address of the queue."]
    #[doc = " @param list Pointer to sys_slist_t object."]
    #[doc = ""]
    #[doc = " @return N/A"]
    pub fn k_queue_merge_slist(queue: *mut k_queue, list: *mut sys_slist_t);
}
#[doc = " @}"]
#[repr(C)]
pub struct k_fifo {
    pub _queue: k_queue,
}
#[test]
fn bindgen_test_layout_k_fifo() {
    assert_eq!(
        ::core::mem::size_of::<k_fifo>(),
        16usize,
        concat!("Size of: ", stringify!(k_fifo))
    );
    assert_eq!(
        ::core::mem::align_of::<k_fifo>(),
        4usize,
        concat!("Alignment of ", stringify!(k_fifo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_fifo>()))._queue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_fifo),
            "::",
            stringify!(_queue)
        )
    );
}
#[doc = " @}"]
#[repr(C)]
pub struct k_lifo {
    pub _queue: k_queue,
}
#[test]
fn bindgen_test_layout_k_lifo() {
    assert_eq!(
        ::core::mem::size_of::<k_lifo>(),
        16usize,
        concat!("Size of: ", stringify!(k_lifo))
    );
    assert_eq!(
        ::core::mem::align_of::<k_lifo>(),
        4usize,
        concat!("Alignment of ", stringify!(k_lifo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_lifo>()))._queue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_lifo),
            "::",
            stringify!(_queue)
        )
    );
}
#[repr(C)]
pub struct k_stack {
    pub wait_q: _wait_q_t,
    pub base: *mut u32_t,
    pub next: *mut u32_t,
    pub top: *mut u32_t,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
    pub flags: u8_t,
}
#[test]
fn bindgen_test_layout_k_stack() {
    assert_eq!(
        ::core::mem::size_of::<k_stack>(),
        24usize,
        concat!("Size of: ", stringify!(k_stack))
    );
    assert_eq!(
        ::core::mem::align_of::<k_stack>(),
        4usize,
        concat!("Alignment of ", stringify!(k_stack))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_stack>())).wait_q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_stack),
            "::",
            stringify!(wait_q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_stack>())).base as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_stack),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_stack>())).next as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_stack),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_stack>())).top as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_stack),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_stack>())).__dummy_next as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_stack),
            "::",
            stringify!(__dummy_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_stack>())).flags as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_stack),
            "::",
            stringify!(flags)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize a stack."]
    #[doc = ""]
    #[doc = " This routine initializes a stack object, prior to its first use."]
    #[doc = ""]
    #[doc = " @param stack Address of the stack."]
    #[doc = " @param buffer Address of array used to hold stacked values."]
    #[doc = " @param num_entries Maximum number of values that can be stacked."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-STACK-001"]
    pub fn k_stack_init(stack: *mut k_stack, buffer: *mut u32_t, num_entries: u32_t);
}
extern "C" {
    #[doc = " @brief Release a stack\'s allocated buffer"]
    #[doc = ""]
    #[doc = " If a stack object was given a dynamically allocated buffer via"]
    #[doc = " k_stack_alloc_init(), this will free it. This function does nothing"]
    #[doc = " if the buffer wasn\'t dynamically allocated."]
    #[doc = ""]
    #[doc = " @param stack Address of the stack."]
    #[doc = " @req K-STACK-001"]
    pub fn k_stack_cleanup(stack: *mut k_stack);
}
#[doc = " @typedef k_work_handler_t"]
#[doc = " @brief Work item handler function type."]
#[doc = ""]
#[doc = " A work item\'s handler function is executed by a workqueue\'s thread"]
#[doc = " when the work item is processed by the workqueue."]
#[doc = ""]
#[doc = " @param work Address of the work item."]
#[doc = ""]
#[doc = " @return N/A"]
#[doc = " @req K-WORK-001"]
pub type k_work_handler_t = ::core::option::Option<unsafe extern "C" fn(work: *mut k_work)>;
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
pub struct k_work_q {
    pub queue: k_queue,
    pub thread: k_thread,
}
#[test]
fn bindgen_test_layout_k_work_q() {
    assert_eq!(
        ::core::mem::size_of::<k_work_q>(),
        116usize,
        concat!("Size of: ", stringify!(k_work_q))
    );
    assert_eq!(
        ::core::mem::align_of::<k_work_q>(),
        4usize,
        concat!("Alignment of ", stringify!(k_work_q))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_work_q>())).queue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_work_q),
            "::",
            stringify!(queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_work_q>())).thread as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_work_q),
            "::",
            stringify!(thread)
        )
    );
}
pub const K_WORK_STATE_PENDING: _bindgen_ty_1 = 0;
pub type _bindgen_ty_1 = u32;
#[doc = " @}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_work {
    pub _reserved: *mut cty::c_void,
    pub handler: k_work_handler_t,
    pub flags: [atomic_t; 1usize],
}
#[test]
fn bindgen_test_layout_k_work() {
    assert_eq!(
        ::core::mem::size_of::<k_work>(),
        12usize,
        concat!("Size of: ", stringify!(k_work))
    );
    assert_eq!(
        ::core::mem::align_of::<k_work>(),
        4usize,
        concat!("Alignment of ", stringify!(k_work))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_work>()))._reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_work),
            "::",
            stringify!(_reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_work>())).handler as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_work),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_work>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_work),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_delayed_work {
    pub work: k_work,
    pub timeout: _timeout,
    pub work_q: *mut k_work_q,
}
#[test]
fn bindgen_test_layout_k_delayed_work() {
    assert_eq!(
        ::core::mem::size_of::<k_delayed_work>(),
        32usize,
        concat!("Size of: ", stringify!(k_delayed_work))
    );
    assert_eq!(
        ::core::mem::align_of::<k_delayed_work>(),
        4usize,
        concat!("Alignment of ", stringify!(k_delayed_work))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_delayed_work>())).work as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_delayed_work),
            "::",
            stringify!(work)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_delayed_work>())).timeout as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_delayed_work),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_delayed_work>())).work_q as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(k_delayed_work),
            "::",
            stringify!(work_q)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}k_sys_work_q"]
    pub static mut k_sys_work_q: k_work_q;
}
extern "C" {
    #[doc = " @brief Start a workqueue."]
    #[doc = ""]
    #[doc = " This routine starts workqueue @a work_q. The workqueue spawns its work"]
    #[doc = " processing thread, which runs forever."]
    #[doc = ""]
    #[doc = " @param work_q Address of workqueue."]
    #[doc = " @param stack Pointer to work queue thread\'s stack space, as defined by"]
    #[doc = "\t\tK_THREAD_STACK_DEFINE()"]
    #[doc = " @param stack_size Size of the work queue thread\'s stack (in bytes), which"]
    #[doc = "\t\tshould either be the same constant passed to"]
    #[doc = "\t\tK_THREAD_STACK_DEFINE() or the value of K_THREAD_STACK_SIZEOF()."]
    #[doc = " @param prio Priority of the work queue\'s thread."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-WORK-001"]
    pub fn k_work_q_start(
        work_q: *mut k_work_q,
        stack: *mut k_thread_stack_t,
        stack_size: usize,
        prio: cty::c_int,
    );
}
extern "C" {
    #[doc = " @brief Start a workqueue in user mode"]
    #[doc = ""]
    #[doc = " This works identically to k_work_q_start() except it is callable from user"]
    #[doc = " mode, and the worker thread created will run in user mode."]
    #[doc = " The caller must have permissions granted on both the work_q parameter\'s"]
    #[doc = " thread and queue objects, and the same restrictions on priority apply as"]
    #[doc = " k_thread_create()."]
    #[doc = ""]
    #[doc = " @param work_q Address of workqueue."]
    #[doc = " @param stack Pointer to work queue thread\'s stack space, as defined by"]
    #[doc = "\t\tK_THREAD_STACK_DEFINE()"]
    #[doc = " @param stack_size Size of the work queue thread\'s stack (in bytes), which"]
    #[doc = "\t\tshould either be the same constant passed to"]
    #[doc = "\t\tK_THREAD_STACK_DEFINE() or the value of K_THREAD_STACK_SIZEOF()."]
    #[doc = " @param prio Priority of the work queue\'s thread."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-WORK-001"]
    pub fn k_work_q_user_start(
        work_q: *mut k_work_q,
        stack: *mut k_thread_stack_t,
        stack_size: usize,
        prio: cty::c_int,
    );
}
extern "C" {
    #[doc = " @brief Initialize a delayed work item."]
    #[doc = ""]
    #[doc = " This routine initializes a workqueue delayed work item, prior to"]
    #[doc = " its first use."]
    #[doc = ""]
    #[doc = " @param work Address of delayed work item."]
    #[doc = " @param handler Function to invoke each time work item is processed."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-DWORK-001"]
    pub fn k_delayed_work_init(work: *mut k_delayed_work, handler: k_work_handler_t);
}
extern "C" {
    #[doc = " @brief Submit a delayed work item."]
    #[doc = ""]
    #[doc = " This routine schedules work item @a work to be processed by workqueue"]
    #[doc = " @a work_q after a delay of @a delay milliseconds. The routine initiates"]
    #[doc = " an asynchronous countdown for the work item and then returns to the caller."]
    #[doc = " Only when the countdown completes is the work item actually submitted to"]
    #[doc = " the workqueue and becomes pending."]
    #[doc = ""]
    #[doc = " Submitting a previously submitted delayed work item that is still"]
    #[doc = " counting down cancels the existing submission and restarts the"]
    #[doc = " countdown using the new delay.  Note that this behavior is"]
    #[doc = " inherently subject to race conditions with the pre-existing"]
    #[doc = " timeouts and work queue, so care must be taken to synchronize such"]
    #[doc = " resubmissions externally."]
    #[doc = ""]
    #[doc = " @warning"]
    #[doc = " A delayed work item must not be modified until it has been processed"]
    #[doc = " by the workqueue."]
    #[doc = ""]
    #[doc = " @note Can be called by ISRs."]
    #[doc = ""]
    #[doc = " @param work_q Address of workqueue."]
    #[doc = " @param work Address of delayed work item."]
    #[doc = " @param delay Delay before submitting the work item (in milliseconds)."]
    #[doc = ""]
    #[doc = " @retval 0 Work item countdown started."]
    #[doc = " @retval -EINPROGRESS Work item is already pending."]
    #[doc = " @retval -EINVAL Work item is being processed or has completed its work."]
    #[doc = " @retval -EADDRINUSE Work item is pending on a different workqueue."]
    #[doc = " @req K-DWORK-001"]
    pub fn k_delayed_work_submit_to_queue(
        work_q: *mut k_work_q,
        work: *mut k_delayed_work,
        delay: s32_t,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Cancel a delayed work item."]
    #[doc = ""]
    #[doc = " This routine cancels the submission of delayed work item @a work."]
    #[doc = " A delayed work item can only be canceled while its countdown is still"]
    #[doc = " underway."]
    #[doc = ""]
    #[doc = " @note Can be called by ISRs."]
    #[doc = ""]
    #[doc = " @param work Address of delayed work item."]
    #[doc = ""]
    #[doc = " @retval 0 Work item countdown canceled."]
    #[doc = " @retval -EINPROGRESS Work item is already pending."]
    #[doc = " @retval -EINVAL Work item is being processed or has completed its work."]
    #[doc = " @req K-DWORK-001"]
    pub fn k_delayed_work_cancel(work: *mut k_delayed_work) -> cty::c_int;
}
#[doc = " Mutex Structure"]
#[doc = " @ingroup mutex_apis"]
#[repr(C)]
pub struct k_mutex {
    pub wait_q: _wait_q_t,
    #[doc = " Mutex owner"]
    pub owner: *mut k_thread,
    pub lock_count: u32_t,
    pub owner_orig_prio: cty::c_int,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
}
#[test]
fn bindgen_test_layout_k_mutex() {
    assert_eq!(
        ::core::mem::size_of::<k_mutex>(),
        20usize,
        concat!("Size of: ", stringify!(k_mutex))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mutex>(),
        4usize,
        concat!("Alignment of ", stringify!(k_mutex))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mutex>())).wait_q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mutex),
            "::",
            stringify!(wait_q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mutex>())).owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mutex),
            "::",
            stringify!(owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mutex>())).lock_count as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mutex),
            "::",
            stringify!(lock_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mutex>())).owner_orig_prio as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mutex),
            "::",
            stringify!(owner_orig_prio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mutex>())).__dummy_next as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mutex),
            "::",
            stringify!(__dummy_next)
        )
    );
}
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
pub struct k_sem {
    pub wait_q: _wait_q_t,
    pub count: u32_t,
    pub limit: u32_t,
    pub poll_events: sys_dlist_t,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
}
#[test]
fn bindgen_test_layout_k_sem() {
    assert_eq!(
        ::core::mem::size_of::<k_sem>(),
        24usize,
        concat!("Size of: ", stringify!(k_sem))
    );
    assert_eq!(
        ::core::mem::align_of::<k_sem>(),
        4usize,
        concat!("Alignment of ", stringify!(k_sem))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_sem>())).wait_q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_sem),
            "::",
            stringify!(wait_q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_sem>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_sem),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_sem>())).limit as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_sem),
            "::",
            stringify!(limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_sem>())).poll_events as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_sem),
            "::",
            stringify!(poll_events)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_sem>())).__dummy_next as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(k_sem),
            "::",
            stringify!(__dummy_next)
        )
    );
}
#[doc = " @typedef k_alert_handler_t"]
#[doc = " @brief Alert handler function type."]
#[doc = ""]
#[doc = " An alert\'s alert handler function is invoked by the system workqueue"]
#[doc = " when the alert is signaled. The alert handler function is optional,"]
#[doc = " and is only invoked if the alert has been initialized with one."]
#[doc = ""]
#[doc = " @param alert Address of the alert."]
#[doc = ""]
#[doc = " @return 0 if alert has been consumed; non-zero if alert should pend."]
pub type k_alert_handler_t =
    ::core::option::Option<unsafe extern "C" fn(alert: *mut k_alert) -> cty::c_int>;
#[repr(C)]
pub struct k_alert {
    pub handler: k_alert_handler_t,
    pub send_count: atomic_t,
    pub work_item: k_work,
    pub sem: k_sem,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
}
#[test]
fn bindgen_test_layout_k_alert() {
    assert_eq!(
        ::core::mem::size_of::<k_alert>(),
        44usize,
        concat!("Size of: ", stringify!(k_alert))
    );
    assert_eq!(
        ::core::mem::align_of::<k_alert>(),
        4usize,
        concat!("Alignment of ", stringify!(k_alert))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_alert>())).handler as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_alert),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_alert>())).send_count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_alert),
            "::",
            stringify!(send_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_alert>())).work_item as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_alert),
            "::",
            stringify!(work_item)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_alert>())).sem as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_alert),
            "::",
            stringify!(sem)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_alert>())).__dummy_next as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(k_alert),
            "::",
            stringify!(__dummy_next)
        )
    );
}
extern "C" {
    #[doc = " @internal"]
    pub fn _alert_deliver(work: *mut k_work);
}
extern "C" {
    #[doc = " @brief Initialize an alert."]
    #[doc = ""]
    #[doc = " This routine initializes an alert object, prior to its first use."]
    #[doc = ""]
    #[doc = " @param alert Address of the alert."]
    #[doc = " @param handler Action to take when alert is sent. Specify either the address"]
    #[doc = "                of a function to be invoked by the system workqueue thread,"]
    #[doc = "                K_ALERT_IGNORE (which causes the alert to be ignored), or"]
    #[doc = "                K_ALERT_DEFAULT (which causes the alert to pend)."]
    #[doc = " @param max_num_pending_alerts Maximum number of pending alerts."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-ALERT-002"]
    pub fn k_alert_init(
        alert: *mut k_alert,
        handler: k_alert_handler_t,
        max_num_pending_alerts: cty::c_uint,
    );
}
#[doc = " @brief Message Queue Structure"]
#[repr(C)]
pub struct k_msgq {
    pub wait_q: _wait_q_t,
    pub msg_size: usize,
    pub max_msgs: u32_t,
    pub buffer_start: *mut cty::c_char,
    pub buffer_end: *mut cty::c_char,
    pub read_ptr: *mut cty::c_char,
    pub write_ptr: *mut cty::c_char,
    pub used_msgs: u32_t,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
    pub flags: u8_t,
}
#[test]
fn bindgen_test_layout_k_msgq() {
    assert_eq!(
        ::core::mem::size_of::<k_msgq>(),
        40usize,
        concat!("Size of: ", stringify!(k_msgq))
    );
    assert_eq!(
        ::core::mem::align_of::<k_msgq>(),
        4usize,
        concat!("Alignment of ", stringify!(k_msgq))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).wait_q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(wait_q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).msg_size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(msg_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).max_msgs as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(max_msgs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).buffer_start as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(buffer_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).buffer_end as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(buffer_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).read_ptr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).write_ptr as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).used_msgs as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(used_msgs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).__dummy_next as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(__dummy_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq>())).flags as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq),
            "::",
            stringify!(flags)
        )
    );
}
#[doc = " @brief Message Queue Attributes"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_msgq_attrs {
    pub msg_size: usize,
    pub max_msgs: u32_t,
    pub used_msgs: u32_t,
}
#[test]
fn bindgen_test_layout_k_msgq_attrs() {
    assert_eq!(
        ::core::mem::size_of::<k_msgq_attrs>(),
        12usize,
        concat!("Size of: ", stringify!(k_msgq_attrs))
    );
    assert_eq!(
        ::core::mem::align_of::<k_msgq_attrs>(),
        4usize,
        concat!("Alignment of ", stringify!(k_msgq_attrs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq_attrs>())).msg_size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq_attrs),
            "::",
            stringify!(msg_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq_attrs>())).max_msgs as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq_attrs),
            "::",
            stringify!(max_msgs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_msgq_attrs>())).used_msgs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_msgq_attrs),
            "::",
            stringify!(used_msgs)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize a message queue."]
    #[doc = ""]
    #[doc = " This routine initializes a message queue object, prior to its first use."]
    #[doc = ""]
    #[doc = " The message queue\'s ring buffer must contain space for @a max_msgs messages,"]
    #[doc = " each of which is @a msg_size bytes long. The buffer must be aligned to an"]
    #[doc = " N-byte boundary, where N is a power of 2 (i.e. 1, 2, 4, ...). To ensure"]
    #[doc = " that each message is similarly aligned to this boundary, @a q_msg_size"]
    #[doc = " must also be a multiple of N."]
    #[doc = ""]
    #[doc = " @param q Address of the message queue."]
    #[doc = " @param buffer Pointer to ring buffer that holds queued messages."]
    #[doc = " @param msg_size Message size (in bytes)."]
    #[doc = " @param max_msgs Maximum number of messages that can be queued."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MSGQ-002"]
    pub fn k_msgq_init(q: *mut k_msgq, buffer: *mut cty::c_char, msg_size: usize, max_msgs: u32_t);
}
extern "C" {
    pub fn k_msgq_cleanup(q: *mut k_msgq);
}
#[doc = " @defgroup mem_pool_apis Memory Pool APIs"]
#[doc = " @ingroup kernel_apis"]
#[doc = " @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_mem_block_id {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_k_mem_block_id() {
    assert_eq!(
        ::core::mem::size_of::<k_mem_block_id>(),
        4usize,
        concat!("Size of: ", stringify!(k_mem_block_id))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mem_block_id>(),
        4usize,
        concat!("Alignment of ", stringify!(k_mem_block_id))
    );
}
impl k_mem_block_id {
    #[inline]
    pub fn pool(&self) -> u32_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_pool(&mut self, val: u32_t) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn level(&self) -> u32_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_level(&mut self, val: u32_t) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn block(&self) -> u32_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 20u8) as u32) }
    }
    #[inline]
    pub fn set_block(&mut self, val: u32_t) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 20u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pool: u32_t,
        level: u32_t,
        block: u32_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let pool: u32 = unsafe { ::core::mem::transmute(pool) };
            pool as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let level: u32 = unsafe { ::core::mem::transmute(level) };
            level as u64
        });
        __bindgen_bitfield_unit.set(12usize, 20u8, {
            let block: u32 = unsafe { ::core::mem::transmute(block) };
            block as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_mem_block {
    pub data: *mut cty::c_void,
    pub id: k_mem_block_id,
}
#[test]
fn bindgen_test_layout_k_mem_block() {
    assert_eq!(
        ::core::mem::size_of::<k_mem_block>(),
        8usize,
        concat!("Size of: ", stringify!(k_mem_block))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mem_block>(),
        4usize,
        concat!("Alignment of ", stringify!(k_mem_block))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_block>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_block),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_block>())).id as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_block),
            "::",
            stringify!(id)
        )
    );
}
#[doc = " @defgroup mailbox_apis Mailbox APIs"]
#[doc = " @ingroup kernel_apis"]
#[doc = " @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_mbox_msg {
    #[doc = " internal use only - needed for legacy API support"]
    pub _mailbox: u32_t,
    #[doc = " size of message (in bytes)"]
    pub size: usize,
    #[doc = " application-defined information value"]
    pub info: u32_t,
    #[doc = " sender\'s message data buffer"]
    pub tx_data: *mut cty::c_void,
    #[doc = " internal use only - needed for legacy API support"]
    pub _rx_data: *mut cty::c_void,
    #[doc = " message data block descriptor"]
    pub tx_block: k_mem_block,
    #[doc = " source thread id"]
    pub rx_source_thread: k_tid_t,
    #[doc = " target thread id"]
    pub tx_target_thread: k_tid_t,
    #[doc = " internal use only - thread waiting on send (may be a dummy)"]
    pub _syncing_thread: k_tid_t,
    #[doc = " internal use only - semaphore used during asynchronous send"]
    pub _async_sem: *mut k_sem,
}
#[test]
fn bindgen_test_layout_k_mbox_msg() {
    assert_eq!(
        ::core::mem::size_of::<k_mbox_msg>(),
        44usize,
        concat!("Size of: ", stringify!(k_mbox_msg))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mbox_msg>(),
        4usize,
        concat!("Alignment of ", stringify!(k_mbox_msg))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>()))._mailbox as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(_mailbox)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>())).size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>())).info as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>())).tx_data as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(tx_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>()))._rx_data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(_rx_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>())).tx_block as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(tx_block)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>())).rx_source_thread as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(rx_source_thread)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>())).tx_target_thread as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(tx_target_thread)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>()))._syncing_thread as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(_syncing_thread)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox_msg>()))._async_sem as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox_msg),
            "::",
            stringify!(_async_sem)
        )
    );
}
#[repr(C)]
pub struct k_mbox {
    pub tx_msg_queue: _wait_q_t,
    pub rx_msg_queue: _wait_q_t,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
}
#[test]
fn bindgen_test_layout_k_mbox() {
    assert_eq!(
        ::core::mem::size_of::<k_mbox>(),
        16usize,
        concat!("Size of: ", stringify!(k_mbox))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mbox>(),
        4usize,
        concat!("Alignment of ", stringify!(k_mbox))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox>())).tx_msg_queue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox),
            "::",
            stringify!(tx_msg_queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox>())).rx_msg_queue as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox),
            "::",
            stringify!(rx_msg_queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mbox>())).__dummy_next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mbox),
            "::",
            stringify!(__dummy_next)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize a mailbox."]
    #[doc = ""]
    #[doc = " This routine initializes a mailbox object, prior to its first use."]
    #[doc = ""]
    #[doc = " @param mbox Address of the mailbox."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MBOX-002"]
    pub fn k_mbox_init(mbox: *mut k_mbox);
}
extern "C" {
    #[doc = " @brief Send a mailbox message in a synchronous manner."]
    #[doc = ""]
    #[doc = " This routine sends a message to @a mbox and waits for a receiver to both"]
    #[doc = " receive and process it. The message data may be in a buffer, in a memory"]
    #[doc = " pool block, or non-existent (i.e. an empty message)."]
    #[doc = ""]
    #[doc = " @param mbox Address of the mailbox."]
    #[doc = " @param tx_msg Address of the transmit message descriptor."]
    #[doc = " @param timeout Waiting period for the message to be received (in"]
    #[doc = "                milliseconds), or one of the special values K_NO_WAIT"]
    #[doc = "                and K_FOREVER. Once the message has been received,"]
    #[doc = "                this routine waits as long as necessary for the message"]
    #[doc = "                to be completely processed."]
    #[doc = ""]
    #[doc = " @retval 0 Message sent."]
    #[doc = " @retval -ENOMSG Returned without waiting."]
    #[doc = " @retval -EAGAIN Waiting period timed out."]
    #[doc = " @req K-MBOX-002"]
    pub fn k_mbox_put(mbox: *mut k_mbox, tx_msg: *mut k_mbox_msg, timeout: s32_t) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Send a mailbox message in an asynchronous manner."]
    #[doc = ""]
    #[doc = " This routine sends a message to @a mbox without waiting for a receiver"]
    #[doc = " to process it. The message data may be in a buffer, in a memory pool block,"]
    #[doc = " or non-existent (i.e. an empty message). Optionally, the semaphore @a sem"]
    #[doc = " will be given when the message has been both received and completely"]
    #[doc = " processed by the receiver."]
    #[doc = ""]
    #[doc = " @param mbox Address of the mailbox."]
    #[doc = " @param tx_msg Address of the transmit message descriptor."]
    #[doc = " @param sem Address of a semaphore, or NULL if none is needed."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MBOX-002"]
    pub fn k_mbox_async_put(mbox: *mut k_mbox, tx_msg: *mut k_mbox_msg, sem: *mut k_sem);
}
extern "C" {
    #[doc = " @brief Receive a mailbox message."]
    #[doc = ""]
    #[doc = " This routine receives a message from @a mbox, then optionally retrieves"]
    #[doc = " its data and disposes of the message."]
    #[doc = ""]
    #[doc = " @param mbox Address of the mailbox."]
    #[doc = " @param rx_msg Address of the receive message descriptor."]
    #[doc = " @param buffer Address of the buffer to receive data, or NULL to defer data"]
    #[doc = "               retrieval and message disposal until later."]
    #[doc = " @param timeout Waiting period for a message to be received (in"]
    #[doc = "                milliseconds), or one of the special values K_NO_WAIT"]
    #[doc = "                and K_FOREVER."]
    #[doc = ""]
    #[doc = " @retval 0 Message received."]
    #[doc = " @retval -ENOMSG Returned without waiting."]
    #[doc = " @retval -EAGAIN Waiting period timed out."]
    #[doc = " @req K-MBOX-002"]
    pub fn k_mbox_get(
        mbox: *mut k_mbox,
        rx_msg: *mut k_mbox_msg,
        buffer: *mut cty::c_void,
        timeout: s32_t,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Retrieve mailbox message data into a buffer."]
    #[doc = ""]
    #[doc = " This routine completes the processing of a received message by retrieving"]
    #[doc = " its data into a buffer, then disposing of the message."]
    #[doc = ""]
    #[doc = " Alternatively, this routine can be used to dispose of a received message"]
    #[doc = " without retrieving its data."]
    #[doc = ""]
    #[doc = " @param rx_msg Address of the receive message descriptor."]
    #[doc = " @param buffer Address of the buffer to receive data, or NULL to discard"]
    #[doc = "               the data."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MBOX-002"]
    pub fn k_mbox_data_get(rx_msg: *mut k_mbox_msg, buffer: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Retrieve mailbox message data into a memory pool block."]
    #[doc = ""]
    #[doc = " This routine completes the processing of a received message by retrieving"]
    #[doc = " its data into a memory pool block, then disposing of the message."]
    #[doc = " The memory pool block that results from successful retrieval must be"]
    #[doc = " returned to the pool once the data has been processed, even in cases"]
    #[doc = " where zero bytes of data are retrieved."]
    #[doc = ""]
    #[doc = " Alternatively, this routine can be used to dispose of a received message"]
    #[doc = " without retrieving its data. In this case there is no need to return a"]
    #[doc = " memory pool block to the pool."]
    #[doc = ""]
    #[doc = " This routine allocates a new memory pool block for the data only if the"]
    #[doc = " data is not already in one. If a new block cannot be allocated, the routine"]
    #[doc = " returns a failure code and the received message is left unchanged. This"]
    #[doc = " permits the caller to reattempt data retrieval at a later time or to dispose"]
    #[doc = " of the received message without retrieving its data."]
    #[doc = ""]
    #[doc = " @param rx_msg Address of a receive message descriptor."]
    #[doc = " @param pool Address of memory pool, or NULL to discard data."]
    #[doc = " @param block Address of the area to hold memory pool block info."]
    #[doc = " @param timeout Waiting period to wait for a memory pool block (in"]
    #[doc = "                milliseconds), or one of the special values K_NO_WAIT"]
    #[doc = "                and K_FOREVER."]
    #[doc = ""]
    #[doc = " @retval 0 Data retrieved."]
    #[doc = " @retval -ENOMEM Returned without waiting."]
    #[doc = " @retval -EAGAIN Waiting period timed out."]
    #[doc = " @req K-MBOX-002"]
    pub fn k_mbox_data_block_get(
        rx_msg: *mut k_mbox_msg,
        pool: *mut k_mem_pool,
        block: *mut k_mem_block,
        timeout: s32_t,
    ) -> cty::c_int;
}
#[doc = " Pipe Structure"]
#[repr(C)]
pub struct k_pipe {
    #[doc = "< Pipe buffer: may be NULL"]
    pub buffer: *mut cty::c_uchar,
    #[doc = "< Buffer size"]
    pub size: usize,
    #[doc = "< # bytes used in buffer"]
    pub bytes_used: usize,
    #[doc = "< Where in buffer to read from"]
    pub read_index: usize,
    #[doc = "< Where in buffer to write"]
    pub write_index: usize,
    pub wait_q: k_pipe__bindgen_ty_1,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
    #[doc = "< Flags"]
    pub flags: u8_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_pipe__bindgen_ty_1 {
    #[doc = "< Reader wait queue"]
    pub readers: _wait_q_t,
    #[doc = "< Writer wait queue"]
    pub writers: _wait_q_t,
}
#[test]
fn bindgen_test_layout_k_pipe__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<k_pipe__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(k_pipe__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<k_pipe__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(k_pipe__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe__bindgen_ty_1>())).readers as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe__bindgen_ty_1),
            "::",
            stringify!(readers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe__bindgen_ty_1>())).writers as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe__bindgen_ty_1),
            "::",
            stringify!(writers)
        )
    );
}
#[test]
fn bindgen_test_layout_k_pipe() {
    assert_eq!(
        ::core::mem::size_of::<k_pipe>(),
        40usize,
        concat!("Size of: ", stringify!(k_pipe))
    );
    assert_eq!(
        ::core::mem::align_of::<k_pipe>(),
        4usize,
        concat!("Alignment of ", stringify!(k_pipe))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe>())).buffer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe>())).size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe>())).bytes_used as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe),
            "::",
            stringify!(bytes_used)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe>())).read_index as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe),
            "::",
            stringify!(read_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe>())).write_index as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe),
            "::",
            stringify!(write_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe>())).wait_q as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe),
            "::",
            stringify!(wait_q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe>())).__dummy_next as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe),
            "::",
            stringify!(__dummy_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_pipe>())).flags as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(k_pipe),
            "::",
            stringify!(flags)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize a pipe."]
    #[doc = ""]
    #[doc = " This routine initializes a pipe object, prior to its first use."]
    #[doc = ""]
    #[doc = " @param pipe Address of the pipe."]
    #[doc = " @param buffer Address of the pipe\'s ring buffer, or NULL if no ring buffer"]
    #[doc = "               is used."]
    #[doc = " @param size Size of the pipe\'s ring buffer (in bytes), or zero if no ring"]
    #[doc = "             buffer is used."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-PIPE-002"]
    pub fn k_pipe_init(pipe: *mut k_pipe, buffer: *mut cty::c_uchar, size: usize);
}
extern "C" {
    #[doc = " @brief Release a pipe\'s allocated buffer"]
    #[doc = ""]
    #[doc = " If a pipe object was given a dynamically allocated buffer via"]
    #[doc = " k_pipe_alloc_init(), this will free it. This function does nothing"]
    #[doc = " if the buffer wasn\'t dynamically allocated."]
    #[doc = ""]
    #[doc = " @param pipe Address of the pipe."]
    #[doc = " @req K-PIPE-002"]
    pub fn k_pipe_cleanup(pipe: *mut k_pipe);
}
extern "C" {
    #[doc = " @brief Write memory block to a pipe."]
    #[doc = ""]
    #[doc = " This routine writes the data contained in a memory block to @a pipe."]
    #[doc = " Once all of the data in the block has been written to the pipe, it will"]
    #[doc = " free the memory block @a block and give the semaphore @a sem (if specified)."]
    #[doc = ""]
    #[doc = " @param pipe Address of the pipe."]
    #[doc = " @param block Memory block containing data to send"]
    #[doc = " @param size Number of data bytes in memory block to send"]
    #[doc = " @param sem Semaphore to signal upon completion (else NULL)"]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-PIPE-002"]
    pub fn k_pipe_block_put(
        pipe: *mut k_pipe,
        block: *mut k_mem_block,
        size: usize,
        sem: *mut k_sem,
    );
}
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
pub struct k_mem_slab {
    pub wait_q: _wait_q_t,
    pub num_blocks: u32_t,
    pub block_size: usize,
    pub buffer: *mut cty::c_char,
    pub free_list: *mut cty::c_char,
    pub num_used: u32_t,
    pub __dummy_next: __IncompleteArrayField<u8_t>,
}
#[test]
fn bindgen_test_layout_k_mem_slab() {
    assert_eq!(
        ::core::mem::size_of::<k_mem_slab>(),
        28usize,
        concat!("Size of: ", stringify!(k_mem_slab))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mem_slab>(),
        4usize,
        concat!("Alignment of ", stringify!(k_mem_slab))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_slab>())).wait_q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_slab),
            "::",
            stringify!(wait_q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_slab>())).num_blocks as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_slab),
            "::",
            stringify!(num_blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_slab>())).block_size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_slab),
            "::",
            stringify!(block_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_slab>())).buffer as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_slab),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_slab>())).free_list as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_slab),
            "::",
            stringify!(free_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_slab>())).num_used as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_slab),
            "::",
            stringify!(num_used)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_slab>())).__dummy_next as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_slab),
            "::",
            stringify!(__dummy_next)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize a memory slab."]
    #[doc = ""]
    #[doc = " Initializes a memory slab, prior to its first use."]
    #[doc = ""]
    #[doc = " The memory slab\'s buffer contains @a slab_num_blocks memory blocks"]
    #[doc = " that are @a slab_block_size bytes long. The buffer must be aligned to an"]
    #[doc = " N-byte boundary, where N is a power of 2 larger than 2 (i.e. 4, 8, 16, ...)."]
    #[doc = " To ensure that each memory block is similarly aligned to this boundary,"]
    #[doc = " @a slab_block_size must also be a multiple of N."]
    #[doc = ""]
    #[doc = " @param slab Address of the memory slab."]
    #[doc = " @param buffer Pointer to buffer used for the memory blocks."]
    #[doc = " @param block_size Size of each memory block (in bytes)."]
    #[doc = " @param num_blocks Number of memory blocks."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MSLAB-002"]
    pub fn k_mem_slab_init(
        slab: *mut k_mem_slab,
        buffer: *mut cty::c_void,
        block_size: usize,
        num_blocks: u32_t,
    );
}
extern "C" {
    #[doc = " @brief Allocate memory from a memory slab."]
    #[doc = ""]
    #[doc = " This routine allocates a memory block from a memory slab."]
    #[doc = ""]
    #[doc = " @param slab Address of the memory slab."]
    #[doc = " @param mem Pointer to block address area."]
    #[doc = " @param timeout Maximum time to wait for operation to complete"]
    #[doc = "        (in milliseconds). Use K_NO_WAIT to return without waiting,"]
    #[doc = "        or K_FOREVER to wait as long as necessary."]
    #[doc = ""]
    #[doc = " @retval 0 Memory allocated. The block address area pointed at by @a mem"]
    #[doc = "         is set to the starting address of the memory block."]
    #[doc = " @retval -ENOMEM Returned without waiting."]
    #[doc = " @retval -EAGAIN Waiting period timed out."]
    #[doc = " @req K-MSLAB-002"]
    pub fn k_mem_slab_alloc(
        slab: *mut k_mem_slab,
        mem: *mut *mut cty::c_void,
        timeout: s32_t,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Free memory allocated from a memory slab."]
    #[doc = ""]
    #[doc = " This routine releases a previously allocated memory block back to its"]
    #[doc = " associated memory slab."]
    #[doc = ""]
    #[doc = " @param slab Address of the memory slab."]
    #[doc = " @param mem Pointer to block address area (as set by k_mem_slab_alloc())."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MSLAB-002"]
    pub fn k_mem_slab_free(slab: *mut k_mem_slab, mem: *mut *mut cty::c_void);
}
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_mem_pool {
    pub base: sys_mem_pool_base,
    pub wait_q: _wait_q_t,
}
#[test]
fn bindgen_test_layout_k_mem_pool() {
    assert_eq!(
        ::core::mem::size_of::<k_mem_pool>(),
        28usize,
        concat!("Size of: ", stringify!(k_mem_pool))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mem_pool>(),
        4usize,
        concat!("Alignment of ", stringify!(k_mem_pool))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_pool>())).base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_pool),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_pool>())).wait_q as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_pool),
            "::",
            stringify!(wait_q)
        )
    );
}
extern "C" {
    #[doc = " @brief Allocate memory from a memory pool."]
    #[doc = ""]
    #[doc = " This routine allocates a memory block from a memory pool."]
    #[doc = ""]
    #[doc = " @param pool Address of the memory pool."]
    #[doc = " @param block Pointer to block descriptor for the allocated memory."]
    #[doc = " @param size Amount of memory to allocate (in bytes)."]
    #[doc = " @param timeout Maximum time to wait for operation to complete"]
    #[doc = "        (in milliseconds). Use K_NO_WAIT to return without waiting,"]
    #[doc = "        or K_FOREVER to wait as long as necessary."]
    #[doc = ""]
    #[doc = " @retval 0 Memory allocated. The @a data field of the block descriptor"]
    #[doc = "         is set to the starting address of the memory block."]
    #[doc = " @retval -ENOMEM Returned without waiting."]
    #[doc = " @retval -EAGAIN Waiting period timed out."]
    #[doc = " @req K-MPOOL-002"]
    pub fn k_mem_pool_alloc(
        pool: *mut k_mem_pool,
        block: *mut k_mem_block,
        size: usize,
        timeout: s32_t,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Allocate memory from a memory pool with malloc() semantics"]
    #[doc = ""]
    #[doc = " Such memory must be released using k_free()."]
    #[doc = ""]
    #[doc = " @param pool Address of the memory pool."]
    #[doc = " @param size Amount of memory to allocate (in bytes)."]
    #[doc = " @return Address of the allocated memory if successful, otherwise NULL"]
    #[doc = " @req K-MPOOL-002"]
    pub fn k_mem_pool_malloc(pool: *mut k_mem_pool, size: usize) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " @brief Free memory allocated from a memory pool."]
    #[doc = ""]
    #[doc = " This routine releases a previously allocated memory block back to its"]
    #[doc = " memory pool."]
    #[doc = ""]
    #[doc = " @param block Pointer to block descriptor for the allocated memory."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MPOOL-002"]
    pub fn k_mem_pool_free(block: *mut k_mem_block);
}
extern "C" {
    #[doc = " @brief Free memory allocated from a memory pool."]
    #[doc = ""]
    #[doc = " This routine releases a previously allocated memory block back to its"]
    #[doc = " memory pool"]
    #[doc = ""]
    #[doc = " @param id Memory block identifier."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MPOOL-002"]
    pub fn k_mem_pool_free_id(id: *mut k_mem_block_id);
}
extern "C" {
    #[doc = " @brief Allocate memory from heap."]
    #[doc = ""]
    #[doc = " This routine provides traditional malloc() semantics. Memory is"]
    #[doc = " allocated from the heap memory pool."]
    #[doc = ""]
    #[doc = " @param size Amount of memory requested (in bytes)."]
    #[doc = ""]
    #[doc = " @return Address of the allocated memory if successful; otherwise NULL."]
    #[doc = " @req K-HEAP-001"]
    pub fn k_malloc(size: usize) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " @brief Free memory allocated from heap."]
    #[doc = ""]
    #[doc = " This routine provides traditional free() semantics. The memory being"]
    #[doc = " returned must have been allocated from the heap memory pool or"]
    #[doc = " k_mem_pool_malloc()."]
    #[doc = ""]
    #[doc = " If @a ptr is NULL, no operation is performed."]
    #[doc = ""]
    #[doc = " @param ptr Pointer to previously allocated memory."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-HEAP-001"]
    pub fn k_free(ptr: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Allocate memory from heap, array style"]
    #[doc = ""]
    #[doc = " This routine provides traditional calloc() semantics. Memory is"]
    #[doc = " allocated from the heap memory pool and zeroed."]
    #[doc = ""]
    #[doc = " @param nmemb Number of elements in the requested array"]
    #[doc = " @param size Size of each array element (in bytes)."]
    #[doc = ""]
    #[doc = " @return Address of the allocated memory if successful; otherwise NULL."]
    #[doc = " @req K-HEAP-001"]
    pub fn k_calloc(nmemb: usize, size: usize) -> *mut cty::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _poller {
    pub thread: *mut k_thread,
    pub is_polling: cty::c_int,
}
#[test]
fn bindgen_test_layout__poller() {
    assert_eq!(
        ::core::mem::size_of::<_poller>(),
        8usize,
        concat!("Size of: ", stringify!(_poller))
    );
    assert_eq!(
        ::core::mem::align_of::<_poller>(),
        4usize,
        concat!("Alignment of ", stringify!(_poller))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_poller>())).thread as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_poller),
            "::",
            stringify!(thread)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_poller>())).is_polling as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_poller),
            "::",
            stringify!(is_polling)
        )
    );
}
pub const _poll_types_bits__POLL_TYPE_IGNORE: _poll_types_bits = 0;
pub const _poll_types_bits__POLL_TYPE_SIGNAL: _poll_types_bits = 1;
pub const _poll_types_bits__POLL_TYPE_SEM_AVAILABLE: _poll_types_bits = 2;
pub const _poll_types_bits__POLL_TYPE_DATA_AVAILABLE: _poll_types_bits = 3;
pub const _poll_types_bits__POLL_NUM_TYPES: _poll_types_bits = 4;
pub type _poll_types_bits = u32;
pub const _poll_states_bits__POLL_STATE_NOT_READY: _poll_states_bits = 0;
pub const _poll_states_bits__POLL_STATE_SIGNALED: _poll_states_bits = 1;
pub const _poll_states_bits__POLL_STATE_SEM_AVAILABLE: _poll_states_bits = 2;
pub const _poll_states_bits__POLL_STATE_DATA_AVAILABLE: _poll_states_bits = 3;
pub const _poll_states_bits__POLL_STATE_CANCELLED: _poll_states_bits = 4;
pub const _poll_states_bits__POLL_NUM_STATES: _poll_states_bits = 5;
pub type _poll_states_bits = u32;
pub const k_poll_modes_K_POLL_MODE_NOTIFY_ONLY: k_poll_modes = 0;
pub const k_poll_modes_K_POLL_NUM_MODES: k_poll_modes = 1;
pub type k_poll_modes = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_poll_signal {
    pub poll_events: sys_dlist_t,
    pub signaled: cty::c_uint,
    pub result: cty::c_int,
}
#[test]
fn bindgen_test_layout_k_poll_signal() {
    assert_eq!(
        ::core::mem::size_of::<k_poll_signal>(),
        16usize,
        concat!("Size of: ", stringify!(k_poll_signal))
    );
    assert_eq!(
        ::core::mem::align_of::<k_poll_signal>(),
        4usize,
        concat!("Alignment of ", stringify!(k_poll_signal))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_poll_signal>())).poll_events as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_signal),
            "::",
            stringify!(poll_events)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_poll_signal>())).signaled as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_signal),
            "::",
            stringify!(signaled)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_poll_signal>())).result as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_signal),
            "::",
            stringify!(result)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_poll_event {
    pub _node: sys_dnode_t,
    pub poller: *mut _poller,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_anon_1: k_poll_event__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union k_poll_event__bindgen_ty_1 {
    pub obj: *mut cty::c_void,
    pub signal: *mut k_poll_signal,
    pub sem: *mut k_sem,
    pub fifo: *mut k_fifo,
    pub queue: *mut k_queue,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_k_poll_event__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<k_poll_event__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(k_poll_event__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<k_poll_event__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(k_poll_event__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_poll_event__bindgen_ty_1>())).obj as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_event__bindgen_ty_1),
            "::",
            stringify!(obj)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<k_poll_event__bindgen_ty_1>())).signal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_event__bindgen_ty_1),
            "::",
            stringify!(signal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_poll_event__bindgen_ty_1>())).sem as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_event__bindgen_ty_1),
            "::",
            stringify!(sem)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<k_poll_event__bindgen_ty_1>())).fifo as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_event__bindgen_ty_1),
            "::",
            stringify!(fifo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<k_poll_event__bindgen_ty_1>())).queue as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_event__bindgen_ty_1),
            "::",
            stringify!(queue)
        )
    );
}
#[test]
fn bindgen_test_layout_k_poll_event() {
    assert_eq!(
        ::core::mem::size_of::<k_poll_event>(),
        20usize,
        concat!("Size of: ", stringify!(k_poll_event))
    );
    assert_eq!(
        ::core::mem::align_of::<k_poll_event>(),
        4usize,
        concat!("Alignment of ", stringify!(k_poll_event))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_poll_event>()))._node as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_event),
            "::",
            stringify!(_node)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_poll_event>())).poller as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_poll_event),
            "::",
            stringify!(poller)
        )
    );
}
impl k_poll_event {
    #[inline]
    pub fn tag(&self) -> u32_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_tag(&mut self, val: u32_t) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> u32_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u32_t) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn state(&self) -> u32_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_state(&mut self, val: u32_t) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn mode(&self) -> u32_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mode(&mut self, val: u32_t) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn unused(&self) -> u32_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 14u8) as u32) }
    }
    #[inline]
    pub fn set_unused(&mut self, val: u32_t) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 14u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        tag: u32_t,
        type_: u32_t,
        state: u32_t,
        mode: u32_t,
        unused: u32_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let tag: u32 = unsafe { ::core::mem::transmute(tag) };
            tag as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let type_: u32 = unsafe { ::core::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(12usize, 5u8, {
            let state: u32 = unsafe { ::core::mem::transmute(state) };
            state as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let mode: u32 = unsafe { ::core::mem::transmute(mode) };
            mode as u64
        });
        __bindgen_bitfield_unit.set(18usize, 14u8, {
            let unused: u32 = unsafe { ::core::mem::transmute(unused) };
            unused as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    #[doc = " @brief Initialize one struct k_poll_event instance"]
    #[doc = ""]
    #[doc = " After this routine is called on a poll event, the event it ready to be"]
    #[doc = " placed in an event array to be passed to k_poll()."]
    #[doc = ""]
    #[doc = " @param event The event to initialize."]
    #[doc = " @param type A bitfield of the types of event, from the K_POLL_TYPE_xxx"]
    #[doc = "             values. Only values that apply to the same object being polled"]
    #[doc = "             can be used together. Choosing K_POLL_TYPE_IGNORE disables the"]
    #[doc = "             event."]
    #[doc = " @param mode Future. Use K_POLL_MODE_NOTIFY_ONLY."]
    #[doc = " @param obj Kernel object or poll signal."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-POLL-001"]
    pub fn k_poll_event_init(
        event: *mut k_poll_event,
        type_: u32_t,
        mode: cty::c_int,
        obj: *mut cty::c_void,
    );
}
extern "C" {
    #[doc = " @internal"]
    pub fn _handle_obj_poll_events(events: *mut sys_dlist_t, state: u32_t);
}
extern "C" {
    #[doc = " @brief Make the CPU idle in an atomic fashion."]
    #[doc = ""]
    #[doc = " Similar to k_cpu_idle(), but called with interrupts locked if operations"]
    #[doc = " must be done atomically before making the CPU idle."]
    #[doc = ""]
    #[doc = " @param key Interrupt locking key obtained from irq_lock()."]
    #[doc = ""]
    #[doc = " @return N/A"]
    #[doc = " @req K-MISC-002"]
    pub fn k_cpu_atomic_idle(key: cty::c_uint);
}
extern "C" {
    #[doc = " @internal"]
    pub fn _sys_power_save_idle_exit(ticks: s32_t);
}
extern "C" {
    #[doc = " @internal"]
    pub fn _init_static_threads();
}
extern "C" {
    #[doc = " @internal"]
    pub fn _is_thread_essential() -> cty::c_int;
}
extern "C" {
    #[doc = " @internal"]
    pub fn _timer_expiration_handler(t: *mut _timeout);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_mem_partition {
    pub start: u32_t,
    pub size: u32_t,
}
#[test]
fn bindgen_test_layout_k_mem_partition() {
    assert_eq!(
        ::core::mem::size_of::<k_mem_partition>(),
        8usize,
        concat!("Size of: ", stringify!(k_mem_partition))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mem_partition>(),
        4usize,
        concat!("Alignment of ", stringify!(k_mem_partition))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_partition>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_partition),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_partition>())).size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_partition),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_mem_domain {
    pub mem_domain_q: sys_dlist_t,
    pub num_partitions: u8_t,
}
#[test]
fn bindgen_test_layout_k_mem_domain() {
    assert_eq!(
        ::core::mem::size_of::<k_mem_domain>(),
        12usize,
        concat!("Size of: ", stringify!(k_mem_domain))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mem_domain>(),
        4usize,
        concat!("Alignment of ", stringify!(k_mem_domain))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_domain>())).mem_domain_q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_domain),
            "::",
            stringify!(mem_domain_q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<k_mem_domain>())).num_partitions as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_mem_domain),
            "::",
            stringify!(num_partitions)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize a memory domain."]
    #[doc = ""]
    #[doc = " Initialize a memory domain with given name and memory partitions."]
    #[doc = ""]
    #[doc = " @param domain The memory domain to be initialized."]
    #[doc = " @param num_parts The number of array items of \"parts\" parameter."]
    #[doc = " @param parts An array of pointers to the memory partitions. Can be NULL"]
    #[doc = "              if num_parts is zero."]
    #[doc = " @req K-MD-001"]
    pub fn k_mem_domain_init(
        domain: *mut k_mem_domain,
        num_parts: u8_t,
        parts: *mut *mut k_mem_partition,
    );
}
extern "C" {
    #[doc = " @brief Destroy a memory domain."]
    #[doc = ""]
    #[doc = " Destroy a memory domain."]
    #[doc = ""]
    #[doc = " @param domain The memory domain to be destroyed."]
    #[doc = " @req K-MD-001"]
    pub fn k_mem_domain_destroy(domain: *mut k_mem_domain);
}
extern "C" {
    #[doc = " @brief Add a memory partition into a memory domain."]
    #[doc = ""]
    #[doc = " Add a memory partition into a memory domain."]
    #[doc = ""]
    #[doc = " @param domain The memory domain to be added a memory partition."]
    #[doc = " @param part The memory partition to be added"]
    #[doc = " @req K-MD-001"]
    pub fn k_mem_domain_add_partition(domain: *mut k_mem_domain, part: *mut k_mem_partition);
}
extern "C" {
    #[doc = " @brief Remove a memory partition from a memory domain."]
    #[doc = ""]
    #[doc = " Remove a memory partition from a memory domain."]
    #[doc = ""]
    #[doc = " @param domain The memory domain to be removed a memory partition."]
    #[doc = " @param part The memory partition to be removed"]
    #[doc = " @req K-MD-001"]
    pub fn k_mem_domain_remove_partition(domain: *mut k_mem_domain, part: *mut k_mem_partition);
}
extern "C" {
    #[doc = " @brief Add a thread into a memory domain."]
    #[doc = ""]
    #[doc = " Add a thread into a memory domain."]
    #[doc = ""]
    #[doc = " @param domain The memory domain that the thread is going to be added into."]
    #[doc = " @param thread ID of thread going to be added into the memory domain."]
    #[doc = ""]
    #[doc = " @req K-MD-001"]
    pub fn k_mem_domain_add_thread(domain: *mut k_mem_domain, thread: k_tid_t);
}
extern "C" {
    #[doc = " @brief Remove a thread from its memory domain."]
    #[doc = ""]
    #[doc = " Remove a thread from its memory domain."]
    #[doc = ""]
    #[doc = " @param thread ID of thread going to be removed from its memory domain."]
    #[doc = " @req K-MD-001"]
    pub fn k_mem_domain_remove_thread(thread: k_tid_t);
}
extern "C" {
    #[doc = " @brief Start a numbered CPU on a MP-capable system"]
    #[doc = ""]
    #[doc = " This starts and initializes a specific CPU.  The main thread on"]
    #[doc = " startup is running on CPU zero, other processors are numbered"]
    #[doc = " sequentially.  On return from this function, the CPU is known to"]
    #[doc = " have begun operating and will enter the provided function.  Its"]
    #[doc = " interrupts will be initialized but disabled such that irq_unlock()"]
    #[doc = " with the provided key will work to enable them."]
    #[doc = ""]
    #[doc = " Normally, in SMP mode this function will be called by the kernel"]
    #[doc = " initialization and should not be used as a user API.  But it is"]
    #[doc = " defined here for special-purpose apps which want Zephyr running on"]
    #[doc = " one core and to use others for design-specific processing."]
    #[doc = ""]
    #[doc = " @param cpu_num Integer number of the CPU"]
    #[doc = " @param stack Stack memory for the CPU"]
    #[doc = " @param sz Stack buffer size, in bytes"]
    #[doc = " @param fn Function to begin running on the CPU.  First argument is"]
    #[doc = "        an irq_unlock() key."]
    #[doc = " @param arg Untyped argument to be passed to \"fn\""]
    pub fn _arch_start_cpu(
        cpu_num: cty::c_int,
        stack: *mut k_thread_stack_t,
        sz: cty::c_int,
        fn_: ::core::option::Option<unsafe extern "C" fn(arg1: cty::c_int, arg2: *mut cty::c_void)>,
        arg: *mut cty::c_void,
    );
}
extern "C" {
    pub fn _impl_k_thread_create(
        new_thread: *mut k_thread,
        stack: *mut k_thread_stack_t,
        stack_size: usize,
        entry: k_thread_entry_t,
        p1: *mut cty::c_void,
        p2: *mut cty::c_void,
        p3: *mut cty::c_void,
        prio: cty::c_int,
        options: u32_t,
        delay: s32_t,
    ) -> k_tid_t;
}
extern "C" {
    pub fn _impl_k_sleep(duration: s32_t) -> s32_t;
}
extern "C" {
    pub fn _impl_k_busy_wait(usec_to_wait: u32_t);
}
extern "C" {
    pub fn _impl_k_yield();
}
extern "C" {
    pub fn _impl_k_wakeup(thread: k_tid_t);
}
extern "C" {
    pub fn _impl_k_current_get() -> k_tid_t;
}
extern "C" {
    pub fn _impl_k_thread_abort(thread: k_tid_t);
}
extern "C" {
    pub fn _impl_k_thread_start(thread: k_tid_t);
}
extern "C" {
    pub fn _impl_k_thread_priority_get(thread: k_tid_t) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_thread_priority_set(thread: k_tid_t, prio: cty::c_int);
}
extern "C" {
    pub fn _impl_k_thread_deadline_set(thread: k_tid_t, deadline: cty::c_int);
}
extern "C" {
    pub fn _impl_k_thread_suspend(thread: k_tid_t);
}
extern "C" {
    pub fn _impl_k_thread_resume(thread: k_tid_t);
}
extern "C" {
    pub fn _impl_k_is_preempt_thread() -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_thread_custom_data_set(value: *mut cty::c_void);
}
extern "C" {
    pub fn _impl_k_thread_custom_data_get() -> *mut cty::c_void;
}
extern "C" {
    pub fn _impl_k_thread_name_set(thread_id: k_tid_t, value: *const cty::c_char);
}
extern "C" {
    pub fn _impl_k_thread_name_get(thread_id: k_tid_t) -> *const cty::c_char;
}
extern "C" {
    pub fn _impl_k_timer_start(timer: *mut k_timer, duration: s32_t, period: s32_t);
}
extern "C" {
    pub fn _impl_k_timer_stop(timer: *mut k_timer);
}
extern "C" {
    pub fn _impl_k_timer_status_get(timer: *mut k_timer) -> u32_t;
}
extern "C" {
    pub fn _impl_k_timer_status_sync(timer: *mut k_timer) -> u32_t;
}
extern "C" {
    pub fn _impl_k_uptime_get() -> s64_t;
}
extern "C" {
    pub fn _impl_k_uptime_get_32() -> u32_t;
}
extern "C" {
    pub fn _impl_k_queue_init(queue: *mut k_queue);
}
extern "C" {
    pub fn _impl_k_queue_cancel_wait(queue: *mut k_queue);
}
extern "C" {
    pub fn _impl_k_queue_alloc_append(queue: *mut k_queue, data: *mut cty::c_void) -> s32_t;
}
extern "C" {
    pub fn _impl_k_queue_alloc_prepend(queue: *mut k_queue, data: *mut cty::c_void) -> s32_t;
}
extern "C" {
    pub fn _impl_k_queue_get(queue: *mut k_queue, timeout: s32_t) -> *mut cty::c_void;
}
extern "C" {
    pub fn _impl_k_stack_alloc_init(stack: *mut k_stack, num_entries: u32_t) -> s32_t;
}
extern "C" {
    pub fn _impl_k_stack_push(stack: *mut k_stack, data: u32_t);
}
extern "C" {
    pub fn _impl_k_stack_pop(stack: *mut k_stack, data: *mut u32_t, timeout: s32_t) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_mutex_init(mutex: *mut k_mutex);
}
extern "C" {
    pub fn _impl_k_mutex_lock(mutex: *mut k_mutex, timeout: s32_t) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_mutex_unlock(mutex: *mut k_mutex);
}
extern "C" {
    pub fn _impl_k_sem_init(sem: *mut k_sem, initial_count: cty::c_uint, limit: cty::c_uint);
}
extern "C" {
    pub fn _impl_k_sem_take(sem: *mut k_sem, timeout: s32_t) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_sem_give(sem: *mut k_sem);
}
extern "C" {
    pub fn _impl_k_alert_recv(alert: *mut k_alert, timeout: s32_t) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_alert_send(alert: *mut k_alert);
}
extern "C" {
    pub fn _impl_k_msgq_alloc_init(q: *mut k_msgq, msg_size: usize, max_msgs: u32_t) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_msgq_put(q: *mut k_msgq, data: *mut cty::c_void, timeout: s32_t) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_msgq_get(q: *mut k_msgq, data: *mut cty::c_void, timeout: s32_t) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_msgq_peek(q: *mut k_msgq, data: *mut cty::c_void) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_msgq_purge(q: *mut k_msgq);
}
extern "C" {
    pub fn _impl_k_msgq_get_attrs(q: *mut k_msgq, attrs: *mut k_msgq_attrs);
}
extern "C" {
    pub fn _impl_k_pipe_alloc_init(pipe: *mut k_pipe, size: usize) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_pipe_put(
        pipe: *mut k_pipe,
        data: *mut cty::c_void,
        bytes_to_write: usize,
        bytes_written: *mut usize,
        min_xfer: usize,
        timeout: s32_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_pipe_get(
        pipe: *mut k_pipe,
        data: *mut cty::c_void,
        bytes_to_read: usize,
        bytes_read: *mut usize,
        min_xfer: usize,
        timeout: s32_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_poll(
        events: *mut k_poll_event,
        num_events: cty::c_int,
        timeout: s32_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_poll_signal_init(signal: *mut k_poll_signal);
}
extern "C" {
    pub fn _impl_k_poll_signal_check(
        signal: *mut k_poll_signal,
        signaled: *mut cty::c_uint,
        result: *mut cty::c_int,
    );
}
extern "C" {
    pub fn _impl_k_poll_signal_raise(signal: *mut k_poll_signal, result: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn _impl_k_str_out(c: *mut cty::c_char, n: usize);
}
#[doc = " @brief Static device information (In ROM) Per driver instance"]
#[doc = ""]
#[doc = " @param name name of the device"]
#[doc = " @param init init function for the driver"]
#[doc = " @param config_info address of driver instance config information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct device_config {
    pub name: *const cty::c_char,
    pub init: ::core::option::Option<unsafe extern "C" fn(device: *mut device) -> cty::c_int>,
    pub config_info: *const cty::c_void,
}
#[test]
fn bindgen_test_layout_device_config() {
    assert_eq!(
        ::core::mem::size_of::<device_config>(),
        12usize,
        concat!("Size of: ", stringify!(device_config))
    );
    assert_eq!(
        ::core::mem::align_of::<device_config>(),
        4usize,
        concat!("Alignment of ", stringify!(device_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<device_config>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(device_config),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<device_config>())).init as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(device_config),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<device_config>())).config_info as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(device_config),
            "::",
            stringify!(config_info)
        )
    );
}
#[doc = " @brief Runtime device structure (In memory) Per driver instance"]
#[doc = " @param device_config Build time config information"]
#[doc = " @param driver_api pointer to structure containing the API functions for"]
#[doc = " the device type. This pointer is filled in by the driver at init time."]
#[doc = " @param driver_data driver instance data. For driver use only"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct device {
    pub config: *mut device_config,
    pub driver_api: *const cty::c_void,
    pub driver_data: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout_device() {
    assert_eq!(
        ::core::mem::size_of::<device>(),
        12usize,
        concat!("Size of: ", stringify!(device))
    );
    assert_eq!(
        ::core::mem::align_of::<device>(),
        4usize,
        concat!("Alignment of ", stringify!(device))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<device>())).config as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<device>())).driver_api as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(driver_api)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<device>())).driver_data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(driver_data)
        )
    );
}
extern "C" {
    pub fn _sys_device_do_config_level(level: s32_t);
}
extern "C" {
    #[doc = " @brief Indicate that the device is in the middle of a transaction"]
    #[doc = ""]
    #[doc = " Called by a device driver to indicate that it is in the middle of a"]
    #[doc = " transaction."]
    #[doc = ""]
    #[doc = " @param busy_dev Pointer to device structure of the driver instance."]
    pub fn device_busy_set(busy_dev: *mut device);
}
extern "C" {
    #[doc = " @brief Indicate that the device has completed its transaction"]
    #[doc = ""]
    #[doc = " Called by a device driver to indicate the end of a transaction."]
    #[doc = ""]
    #[doc = " @param busy_dev Pointer to device structure of the driver instance."]
    pub fn device_busy_clear(busy_dev: *mut device);
}
extern "C" {
    pub fn _impl_device_get_binding(name: *const cty::c_char) -> *mut device;
}
#[doc = " @brief Constant data associated with the source of log messages."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct log_source_const_data {
    pub name: *const cty::c_char,
    pub level: u8_t,
}
#[test]
fn bindgen_test_layout_log_source_const_data() {
    assert_eq!(
        ::core::mem::size_of::<log_source_const_data>(),
        8usize,
        concat!("Size of: ", stringify!(log_source_const_data))
    );
    assert_eq!(
        ::core::mem::align_of::<log_source_const_data>(),
        4usize,
        concat!("Alignment of ", stringify!(log_source_const_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_source_const_data>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_source_const_data),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_source_const_data>())).level as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(log_source_const_data),
            "::",
            stringify!(level)
        )
    );
}
#[doc = " @brief Dynamic data associated with the source of log messages."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct log_source_dynamic_data {
    pub filters: u32_t,
}
#[test]
fn bindgen_test_layout_log_source_dynamic_data() {
    assert_eq!(
        ::core::mem::size_of::<log_source_dynamic_data>(),
        4usize,
        concat!("Size of: ", stringify!(log_source_dynamic_data))
    );
    assert_eq!(
        ::core::mem::align_of::<log_source_dynamic_data>(),
        4usize,
        concat!("Alignment of ", stringify!(log_source_dynamic_data))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<log_source_dynamic_data>())).filters as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_source_dynamic_data),
            "::",
            stringify!(filters)
        )
    );
}
#[doc = " @brief Part of log message header identifying source and level."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct log_msg_ids {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout_log_msg_ids() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_ids>(),
        2usize,
        concat!("Size of: ", stringify!(log_msg_ids))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_ids>(),
        2usize,
        concat!("Alignment of ", stringify!(log_msg_ids))
    );
}
impl log_msg_ids {
    #[inline]
    pub fn level(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_level(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn domain_id(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_domain_id(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn source_id(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_source_id(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        level: u16_t,
        domain_id: u16_t,
        source_id: u16_t,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let level: u16 = unsafe { ::core::mem::transmute(level) };
            level as u64
        });
        __bindgen_bitfield_unit.set(3usize, 3u8, {
            let domain_id: u16 = unsafe { ::core::mem::transmute(domain_id) };
            domain_id as u64
        });
        __bindgen_bitfield_unit.set(6usize, 10u8, {
            let source_id: u16 = unsafe { ::core::mem::transmute(source_id) };
            source_id as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Part of log message header common to standard and hexdump log message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct log_msg_generic_hdr {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout_log_msg_generic_hdr() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_generic_hdr>(),
        2usize,
        concat!("Size of: ", stringify!(log_msg_generic_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_generic_hdr>(),
        2usize,
        concat!("Alignment of ", stringify!(log_msg_generic_hdr))
    );
}
impl log_msg_generic_hdr {
    #[inline]
    pub fn type_(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ext(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_ext(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 14u8) as u16) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 14u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: u16_t,
        ext: u16_t,
        reserved: u16_t,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let type_: u16 = unsafe { ::core::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ext: u16 = unsafe { ::core::mem::transmute(ext) };
            ext as u64
        });
        __bindgen_bitfield_unit.set(2usize, 14u8, {
            let reserved: u16 = unsafe { ::core::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Part of log message header specific to standard log message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct log_msg_std_hdr {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout_log_msg_std_hdr() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_std_hdr>(),
        2usize,
        concat!("Size of: ", stringify!(log_msg_std_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_std_hdr>(),
        2usize,
        concat!("Alignment of ", stringify!(log_msg_std_hdr))
    );
}
impl log_msg_std_hdr {
    #[inline]
    pub fn type_(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ext(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_ext(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn nargs(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_nargs(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: u16_t,
        ext: u16_t,
        reserved: u16_t,
        nargs: u16_t,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let type_: u16 = unsafe { ::core::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ext: u16 = unsafe { ::core::mem::transmute(ext) };
            ext as u64
        });
        __bindgen_bitfield_unit.set(2usize, 10u8, {
            let reserved: u16 = unsafe { ::core::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let nargs: u16 = unsafe { ::core::mem::transmute(nargs) };
            nargs as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Part of log message header specific to hexdump log message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct log_msg_hexdump_hdr {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout_log_msg_hexdump_hdr() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_hexdump_hdr>(),
        2usize,
        concat!("Size of: ", stringify!(log_msg_hexdump_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_hexdump_hdr>(),
        2usize,
        concat!("Alignment of ", stringify!(log_msg_hexdump_hdr))
    );
}
impl log_msg_hexdump_hdr {
    #[inline]
    pub fn type_(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ext(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_ext(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn raw_string(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_raw_string(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn length(&self) -> u16_t {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 13u8) as u16) }
    }
    #[inline]
    pub fn set_length(&mut self, val: u16_t) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 13u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: u16_t,
        ext: u16_t,
        raw_string: u16_t,
        length: u16_t,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let type_: u16 = unsafe { ::core::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ext: u16 = unsafe { ::core::mem::transmute(ext) };
            ext as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let raw_string: u16 = unsafe { ::core::mem::transmute(raw_string) };
            raw_string as u64
        });
        __bindgen_bitfield_unit.set(3usize, 13u8, {
            let length: u16 = unsafe { ::core::mem::transmute(length) };
            length as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Log message header structure"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct log_msg_hdr {
    #[doc = "< Reference counter for tracking message users."]
    pub ref_cnt: atomic_t,
    pub params: log_msg_hdr_log_msg_hdr_params,
    #[doc = "< Identification part of the message."]
    pub ids: log_msg_ids,
    #[doc = "< Timestamp."]
    pub timestamp: u32_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union log_msg_hdr_log_msg_hdr_params {
    pub generic: log_msg_generic_hdr,
    pub std: log_msg_std_hdr,
    pub hexdump: log_msg_hexdump_hdr,
    pub raw: u16_t,
    _bindgen_union_align: u16,
}
#[test]
fn bindgen_test_layout_log_msg_hdr_log_msg_hdr_params() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_hdr_log_msg_hdr_params>(),
        2usize,
        concat!("Size of: ", stringify!(log_msg_hdr_log_msg_hdr_params))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_hdr_log_msg_hdr_params>(),
        2usize,
        concat!("Alignment of ", stringify!(log_msg_hdr_log_msg_hdr_params))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<log_msg_hdr_log_msg_hdr_params>())).generic as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_hdr_log_msg_hdr_params),
            "::",
            stringify!(generic)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<log_msg_hdr_log_msg_hdr_params>())).std as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_hdr_log_msg_hdr_params),
            "::",
            stringify!(std)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<log_msg_hdr_log_msg_hdr_params>())).hexdump as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_hdr_log_msg_hdr_params),
            "::",
            stringify!(hexdump)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<log_msg_hdr_log_msg_hdr_params>())).raw as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_hdr_log_msg_hdr_params),
            "::",
            stringify!(raw)
        )
    );
}
#[test]
fn bindgen_test_layout_log_msg_hdr() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_hdr>(),
        12usize,
        concat!("Size of: ", stringify!(log_msg_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_hdr>(),
        4usize,
        concat!("Alignment of ", stringify!(log_msg_hdr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_hdr>())).ref_cnt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_hdr),
            "::",
            stringify!(ref_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_hdr>())).params as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_hdr),
            "::",
            stringify!(params)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_hdr>())).ids as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_hdr),
            "::",
            stringify!(ids)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_hdr>())).timestamp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_hdr),
            "::",
            stringify!(timestamp)
        )
    );
}
#[doc = " @brief Data part of log message."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union log_msg_head_data {
    pub args: [u32_t; 3usize],
    pub bytes: [u8_t; 12usize],
    _bindgen_union_align: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_log_msg_head_data() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_head_data>(),
        12usize,
        concat!("Size of: ", stringify!(log_msg_head_data))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_head_data>(),
        4usize,
        concat!("Alignment of ", stringify!(log_msg_head_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_head_data>())).args as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_head_data),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_head_data>())).bytes as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_head_data),
            "::",
            stringify!(bytes)
        )
    );
}
#[doc = " @brief Data part of extended log message."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct log_msg_ext_head_data {
    pub next: *mut log_msg_cont,
    pub data: log_msg_ext_head_data_log_msg_ext_head_data_data,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union log_msg_ext_head_data_log_msg_ext_head_data_data {
    pub args: [u32_t; 2usize],
    pub bytes: [u8_t; 8usize],
    _bindgen_union_align: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_log_msg_ext_head_data_log_msg_ext_head_data_data() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_ext_head_data_log_msg_ext_head_data_data>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(log_msg_ext_head_data_log_msg_ext_head_data_data)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_ext_head_data_log_msg_ext_head_data_data>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(log_msg_ext_head_data_log_msg_ext_head_data_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<log_msg_ext_head_data_log_msg_ext_head_data_data>())).args
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_ext_head_data_log_msg_ext_head_data_data),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<log_msg_ext_head_data_log_msg_ext_head_data_data>())).bytes
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_ext_head_data_log_msg_ext_head_data_data),
            "::",
            stringify!(bytes)
        )
    );
}
#[test]
fn bindgen_test_layout_log_msg_ext_head_data() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_ext_head_data>(),
        12usize,
        concat!("Size of: ", stringify!(log_msg_ext_head_data))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_ext_head_data>(),
        4usize,
        concat!("Alignment of ", stringify!(log_msg_ext_head_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_ext_head_data>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_ext_head_data),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_ext_head_data>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_ext_head_data),
            "::",
            stringify!(data)
        )
    );
}
#[doc = " @brief Log message structure."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct log_msg {
    #[doc = "< Used by logger core list."]
    pub next: *mut log_msg,
    #[doc = "< Message header."]
    pub hdr: log_msg_hdr,
    pub str: *const cty::c_char,
    #[doc = "< Message data."]
    pub payload: log_msg_log_msg_data,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union log_msg_log_msg_data {
    pub single: log_msg_head_data,
    pub ext: log_msg_ext_head_data,
    _bindgen_union_align: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_log_msg_log_msg_data() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_log_msg_data>(),
        12usize,
        concat!("Size of: ", stringify!(log_msg_log_msg_data))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_log_msg_data>(),
        4usize,
        concat!("Alignment of ", stringify!(log_msg_log_msg_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_log_msg_data>())).single as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_log_msg_data),
            "::",
            stringify!(single)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_log_msg_data>())).ext as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_log_msg_data),
            "::",
            stringify!(ext)
        )
    );
}
#[test]
fn bindgen_test_layout_log_msg() {
    assert_eq!(
        ::core::mem::size_of::<log_msg>(),
        32usize,
        concat!("Size of: ", stringify!(log_msg))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg>(),
        4usize,
        concat!("Alignment of ", stringify!(log_msg))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg>())).hdr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg>())).str as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg),
            "::",
            stringify!(str)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg>())).payload as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg),
            "::",
            stringify!(payload)
        )
    );
}
#[doc = " @brief Chunks following message head when message is extended."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct log_msg_cont {
    #[doc = "< Pointer to the next chunk."]
    pub next: *mut log_msg_cont,
    pub payload: log_msg_cont_log_msg_cont_data,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union log_msg_cont_log_msg_cont_data {
    pub args: [u32_t; 7usize],
    pub bytes: [u8_t; 28usize],
    _bindgen_union_align: [u32; 7usize],
}
#[test]
fn bindgen_test_layout_log_msg_cont_log_msg_cont_data() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_cont_log_msg_cont_data>(),
        28usize,
        concat!("Size of: ", stringify!(log_msg_cont_log_msg_cont_data))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_cont_log_msg_cont_data>(),
        4usize,
        concat!("Alignment of ", stringify!(log_msg_cont_log_msg_cont_data))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<log_msg_cont_log_msg_cont_data>())).args as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_cont_log_msg_cont_data),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<log_msg_cont_log_msg_cont_data>())).bytes as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_cont_log_msg_cont_data),
            "::",
            stringify!(bytes)
        )
    );
}
#[test]
fn bindgen_test_layout_log_msg_cont() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_cont>(),
        32usize,
        concat!("Size of: ", stringify!(log_msg_cont))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_cont>(),
        4usize,
        concat!("Alignment of ", stringify!(log_msg_cont))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_cont>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_cont),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_cont>())).payload as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_cont),
            "::",
            stringify!(payload)
        )
    );
}
#[doc = " @brief Log message"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union log_msg_chunk {
    pub head: log_msg,
    pub cont: log_msg_cont,
    _bindgen_union_align: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_log_msg_chunk() {
    assert_eq!(
        ::core::mem::size_of::<log_msg_chunk>(),
        32usize,
        concat!("Size of: ", stringify!(log_msg_chunk))
    );
    assert_eq!(
        ::core::mem::align_of::<log_msg_chunk>(),
        4usize,
        concat!("Alignment of ", stringify!(log_msg_chunk))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_chunk>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_chunk),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<log_msg_chunk>())).cont as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(log_msg_chunk),
            "::",
            stringify!(cont)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}log_msg_pool"]
    pub static mut log_msg_pool: k_mem_slab;
}
extern "C" {
    #[doc = " @brief Function for initialization of the log message pool."]
    pub fn log_msg_pool_init();
}
extern "C" {
    #[doc = " @brief Function for indicating that message is in use."]
    #[doc = ""]
    #[doc = "  @details Message can be used (read) by multiple users. Internal reference"]
    #[doc = "           counter is atomically increased. See @ref log_msg_put."]
    #[doc = ""]
    #[doc = "  @param msg Message."]
    pub fn log_msg_get(msg: *mut log_msg);
}
extern "C" {
    #[doc = " @brief Function for indicating that message is no longer in use."]
    #[doc = ""]
    #[doc = "  @details Internal reference counter is atomically decreased. If reference"]
    #[doc = "           counter equals 0 message is freed."]
    #[doc = ""]
    #[doc = "  @param msg Message."]
    pub fn log_msg_put(msg: *mut log_msg);
}
extern "C" {
    #[doc = " @brief Returns number of arguments in standard log message."]
    #[doc = ""]
    #[doc = " @param msg Standard log message."]
    #[doc = ""]
    #[doc = " @return Number of arguments."]
    pub fn log_msg_nargs_get(msg: *mut log_msg) -> u32_t;
}
extern "C" {
    #[doc = " @brief Gets argument from standard log message."]
    #[doc = ""]
    #[doc = " @param msg\t\tStandard log message."]
    #[doc = " @param arg_idx\tArgument index."]
    #[doc = ""]
    #[doc = " @return Argument value or 0 if arg_idx exceeds number of arguments in the"]
    #[doc = "\t   message."]
    pub fn log_msg_arg_get(msg: *mut log_msg, arg_idx: u32_t) -> u32_t;
}
extern "C" {
    #[doc = " @brief Gets pointer to the unformatted string from standard log message."]
    #[doc = ""]
    #[doc = " @param msg Standard log message."]
    #[doc = ""]
    #[doc = " @return Pointer to the string."]
    pub fn log_msg_str_get(msg: *mut log_msg) -> *const cty::c_char;
}
extern "C" {
    #[doc = " @brief Allocates chunks for hexdump message and copies the data."]
    #[doc = ""]
    #[doc = "  @details Function resets header and sets following fields:"]
    #[doc = "\t\t- message type"]
    #[doc = "\t\t- length"]
    #[doc = ""]
    #[doc = "  @note Allocation and partial filling is combined for performance reasons."]
    #[doc = ""]
    #[doc = " @param str\t\tString."]
    #[doc = " @param data\t\tData."]
    #[doc = " @param length\tData length."]
    #[doc = ""]
    #[doc = " @return Pointer to allocated head of the message or NULL"]
    pub fn log_msg_hexdump_create(
        str: *const cty::c_char,
        data: *const u8_t,
        length: u32_t,
    ) -> *mut log_msg;
}
extern "C" {
    #[doc = " @brief Put data into hexdump log message."]
    #[doc = ""]
    #[doc = " @param[in]\t\tmsg      Message."]
    #[doc = " @param[in]\t\tdata\t Data to be copied."]
    #[doc = " @param[in, out]\tlength   Input: requested amount. Output: actual amount."]
    #[doc = " @param[in]\t\toffset   Offset."]
    pub fn log_msg_hexdump_data_put(
        msg: *mut log_msg,
        data: *mut u8_t,
        length: *mut usize,
        offset: usize,
    );
}
extern "C" {
    #[doc = " @brief Get data from hexdump log message."]
    #[doc = ""]
    #[doc = " @param[in]\t\tmsg      Message."]
    #[doc = " @param[in]\t\tdata\t Buffer for data."]
    #[doc = " @param[in, out]\tlength   Input: requested amount. Output: actual amount."]
    #[doc = " @param[in]\t\toffset   Offset."]
    pub fn log_msg_hexdump_data_get(
        msg: *mut log_msg,
        data: *mut u8_t,
        length: *mut usize,
        offset: usize,
    );
}
extern "C" {
    pub fn log_msg_no_space_handle() -> *mut log_msg_chunk;
}
extern "C" {
    #[doc = " @brief Create standard log message with variable number of arguments."]
    #[doc = ""]
    #[doc = "  @details Function resets header and sets following fields:"]
    #[doc = "\t\t- message type"]
    #[doc = "\t\t- string pointer"]
    #[doc = "\t\t- number of arguments"]
    #[doc = "\t\t- arguments"]
    #[doc = ""]
    #[doc = "  @param str   String."]
    #[doc = "  @param args  Array with arguments."]
    #[doc = "  @param nargs Number of arguments."]
    #[doc = ""]
    #[doc = "  @return Pointer to allocated head of the message or NULL."]
    pub fn log_msg_create_n(
        str: *const cty::c_char,
        args: *mut u32_t,
        nargs: u32_t,
    ) -> *mut log_msg;
}
extern "C" {
    #[link_name = "\u{1}__log_const_start"]
    pub static mut __log_const_start: [log_source_const_data; 0usize];
}
extern "C" {
    #[link_name = "\u{1}__log_const_end"]
    pub static mut __log_const_end: [log_source_const_data; 0usize];
}
extern "C" {
    #[link_name = "\u{1}__log_dynamic_start"]
    pub static mut __log_dynamic_start: [log_source_dynamic_data; 0usize];
}
extern "C" {
    #[link_name = "\u{1}__log_dynamic_end"]
    pub static mut __log_dynamic_end: [log_source_dynamic_data; 0usize];
}
extern "C" {
    #[doc = " @brief Standard log with no arguments."]
    #[doc = ""]
    #[doc = " @param str           String."]
    #[doc = " @param src_level\tLog identification."]
    pub fn log_0(str: *const cty::c_char, src_level: log_msg_ids);
}
extern "C" {
    #[doc = " @brief Standard log with one argument."]
    #[doc = ""]
    #[doc = " @param str           String."]
    #[doc = " @param arg1\t        First argument."]
    #[doc = " @param src_level\tLog identification."]
    pub fn log_1(str: *const cty::c_char, arg1: u32_t, src_level: log_msg_ids);
}
extern "C" {
    #[doc = " @brief Standard log with two arguments."]
    #[doc = ""]
    #[doc = " @param str           String."]
    #[doc = " @param arg1\t        First argument."]
    #[doc = " @param arg2\t        Second argument."]
    #[doc = " @param src_level\tLog identification."]
    pub fn log_2(str: *const cty::c_char, arg1: u32_t, arg2: u32_t, src_level: log_msg_ids);
}
extern "C" {
    #[doc = " @brief Standard log with three arguments."]
    #[doc = ""]
    #[doc = " @param str           String."]
    #[doc = " @param arg1\t        First argument."]
    #[doc = " @param arg2\t        Second argument."]
    #[doc = " @param arg3\t        Third argument."]
    #[doc = " @param src_level\tLog identification."]
    pub fn log_3(
        str: *const cty::c_char,
        arg1: u32_t,
        arg2: u32_t,
        arg3: u32_t,
        src_level: log_msg_ids,
    );
}
extern "C" {
    #[doc = " @brief Standard log with arguments list."]
    #[doc = ""]
    #[doc = " @param str\t\tString."]
    #[doc = " @param args\t\tArray with arguments."]
    #[doc = " @param narg\t\tNumber of arguments in the array."]
    #[doc = " @param src_level\tLog identification."]
    pub fn log_n(str: *const cty::c_char, args: *mut u32_t, narg: u32_t, src_level: log_msg_ids);
}
extern "C" {
    #[doc = " @brief Hexdump log."]
    #[doc = ""]
    #[doc = " @param str\t\tString."]
    #[doc = " @param data\t\tData."]
    #[doc = " @param length\tData length."]
    #[doc = " @param src_level\tLog identification."]
    pub fn log_hexdump(
        str: *const cty::c_char,
        data: *const u8_t,
        length: u32_t,
        src_level: log_msg_ids,
    );
}
extern "C" {
    #[doc = " @brief Format and put string into log message."]
    #[doc = ""]
    #[doc = " @param fmt\tString to format."]
    #[doc = " @param ap\tVariable list of arguments."]
    #[doc = ""]
    #[doc = " @return Number of bytes processed."]
    pub fn log_printk(fmt: *const cty::c_char, ap: va_list) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Writes a generic log message to the log."]
    #[doc = ""]
    #[doc = " @note This function is intended to be used when porting other log systems."]
    pub fn log_generic(src_level: log_msg_ids, fmt: *const cty::c_char, ap: va_list);
}
extern "C" {
    #[doc = " @brief Check if address belongs to the memory pool used for transient."]
    #[doc = ""]
    #[doc = " @param buf Buffer."]
    #[doc = ""]
    #[doc = " @return True if address within the pool, false otherwise."]
    pub fn log_is_strdup(buf: *mut cty::c_void) -> bool;
}
extern "C" {
    #[doc = " @brief Free allocated buffer."]
    #[doc = ""]
    #[doc = " @param buf Buffer."]
    pub fn log_free(buf: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Copy transient string to a buffer from internal, logger pool."]
    #[doc = ""]
    #[doc = " Function should be used when transient string is intended to be logged."]
    #[doc = " Logger allocates a buffer and copies input string returning a pointer to the"]
    #[doc = " copy. Logger ensures that buffer is freed when logger message is freed."]
    #[doc = ""]
    #[doc = " @param str Transient string."]
    #[doc = ""]
    #[doc = " @return Copy of the string or default string if buffer could not be"]
    #[doc = "\t   allocated. String may be truncated if input string does not fit in"]
    #[doc = "\t   a buffer from the pool (see CONFIG_LOG_STRDUP_MAX_STRING)."]
    pub fn log_strdup(str: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    #[link_name = "\u{1}log_const_LOG_MODULE_NAME"]
    pub static log_const_LOG_MODULE_NAME: log_source_const_data;
}
extern "C" {
    #[link_name = "\u{1}log_dynamic_LOG_MODULE_NAME"]
    pub static mut log_dynamic_LOG_MODULE_NAME: log_source_dynamic_data;
}
extern "C" {
    #[link_name = "\u{1}__log_current_const_data"]
    pub static mut __log_current_const_data: *const log_source_const_data;
}
extern "C" {
    #[link_name = "\u{1}__log_current_dynamic_data"]
    pub static mut __log_current_dynamic_data: *mut log_source_dynamic_data;
}
pub const __log_level: u32_t = 0;
pub const net_verdict_NET_OK: net_verdict = 0;
#[doc = " Packet has been taken care of"]
pub const net_verdict_NET_CONTINUE: net_verdict = 1;
#[doc = " Packet has not been touched,"]
#[doc = "other part should decide about its fate"]
pub const net_verdict_NET_DROP: net_verdict = 2;
#[doc = " @brief Net Verdict"]
pub type net_verdict = u32;
extern "C" {
    pub fn net_recv_data(iface: *mut net_if, pkt: *mut net_pkt) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Send data to network."]
    #[doc = ""]
    #[doc = " @details Send data to network. This should not be used normally by"]
    #[doc = " applications as it requires that the pktfer and fragments are properly"]
    #[doc = " constructed."]
    #[doc = ""]
    #[doc = " @param pkt Network packet."]
    #[doc = ""]
    #[doc = " @return 0 if ok, <0 if error. If <0 is returned, then the caller needs"]
    #[doc = " to unref the pkt in order to avoid memory leak."]
    pub fn net_send_data(pkt: *mut net_pkt) -> cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct net_stack_info {
    pub stack: *mut k_thread_stack_t,
    pub pretty_name: *const cty::c_char,
    pub name: *const cty::c_char,
    pub orig_size: usize,
    pub size: usize,
    pub prio: cty::c_int,
    pub idx: cty::c_int,
    pub __bindgen_padding_0: u32,
}
#[test]
fn bindgen_test_layout_net_stack_info() {
    assert_eq!(
        ::core::mem::size_of::<net_stack_info>(),
        32usize,
        concat!("Size of: ", stringify!(net_stack_info))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_stack_info>())).stack as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_stack_info),
            "::",
            stringify!(stack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_stack_info>())).pretty_name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(net_stack_info),
            "::",
            stringify!(pretty_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_stack_info>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(net_stack_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_stack_info>())).orig_size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(net_stack_info),
            "::",
            stringify!(orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_stack_info>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(net_stack_info),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_stack_info>())).prio as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(net_stack_info),
            "::",
            stringify!(prio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_stack_info>())).idx as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(net_stack_info),
            "::",
            stringify!(idx)
        )
    );
}
#[doc = " @brief Simple network buffer representation."]
#[doc = ""]
#[doc = "  This is a simpler variant of the net_buf object (in fact net_buf uses"]
#[doc = "  net_buf_simple internally). It doesn\'t provide any kind of reference"]
#[doc = "  counting, user data, dynamic allocation, or in general the ability to"]
#[doc = "  pass through kernel objects such as FIFOs."]
#[doc = ""]
#[doc = "  The main use of this is for scenarios where the meta-data of the normal"]
#[doc = "  net_buf isn\'t needed and causes too much overhead. This could be e.g."]
#[doc = "  when the buffer only needs to be allocated on the stack or when the"]
#[doc = "  access to and lifetime of the buffer is well controlled and constrained."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct net_buf_simple {
    #[doc = " Pointer to the start of data in the buffer."]
    pub data: *mut u8_t,
    #[doc = " Length of the data behind the data pointer."]
    pub len: u16_t,
    #[doc = " Amount of data that this buffer can store."]
    pub size: u16_t,
    #[doc = " Start of the data storage. Not to be accessed directly"]
    #[doc = "  (the data pointer should be used instead)."]
    pub __buf: *mut u8_t,
}
#[test]
fn bindgen_test_layout_net_buf_simple() {
    assert_eq!(
        ::core::mem::size_of::<net_buf_simple>(),
        12usize,
        concat!("Size of: ", stringify!(net_buf_simple))
    );
    assert_eq!(
        ::core::mem::align_of::<net_buf_simple>(),
        4usize,
        concat!("Alignment of ", stringify!(net_buf_simple))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_buf_simple>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(net_buf_simple),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_buf_simple>())).len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(net_buf_simple),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_buf_simple>())).size as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(net_buf_simple),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<net_buf_simple>())).__buf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(net_buf_simple),
            "::",
            stringify!(__buf)
        )
    );
}
extern "C" {
    #[doc = "  @brief Prepare data to be added at the end of the buffer"]
    #[doc = ""]
    #[doc = "  Increments the data length of a buffer to account for more data"]
    #[doc = "  at the end."]
    #[doc = ""]
    #[doc = "  @param buf Buffer to update."]
    #[doc = "  @param len Number of bytes to increment the length with."]
    #[doc = ""]
    #[doc = "  @return The original tail of the buffer."]
    pub fn net_buf_simple_add(buf: *mut net_buf_simple, len: usize) -> *mut cty::c_void;
}
extern "C" {
    #[doc = "  @brief Copy bytes from memory to the end of the buffer"]
    #[doc = ""]
    #[doc = "  Copies the given number of bytes to the end of the buffer. Increments the"]
    #[doc = "  data length of the  buffer to account for more data at the end."]
    #[doc = ""]
    #[doc = "  @param buf Buffer to update."]
    #[doc = "  @param mem Location of data to be added."]
    #[doc = "  @param len Length of data to be added"]
    #[doc = ""]
    #[doc = "  @return The original tail of the buffer."]
    pub fn net_buf_simple_add_mem(
        buf: *mut net_buf_simple,
        mem: *const cty::c_void,
        len: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    #[doc = "  @brief Add (8-bit) byte at the end of the buffer"]
    #[doc = ""]
    #[doc = "  Adds a byte at the end of the buffer. Increments the data length of"]
    #[doc = "  the  buffer to account for more data at the end."]
    #[doc = ""]
    #[doc = "  @param buf Buffer to update."]
    #[doc = "  @param val byte value to be added."]
    #[doc = ""]
    #[doc = "  @return Pointer to the value added"]
    pub fn net_buf_simple_add_u8(buf: *mut net_buf_simple, val: u8_t) -> *mut u8_t;
}
extern "C" {
    #[doc = "  @brief Add 16-bit value at the end of the buffer"]
    #[doc = ""]
    #[doc = "  Adds 16-bit value in little endian format at the end of buffer."]
    #[doc = "  Increments the data length of a buffer to account for more data"]
    #[doc = "  at the end."]
    #[doc = ""]
    #[doc = "  @param buf Buffer to update."]
    #[doc = "  @param val 16-bit value to be added."]
    pub fn net_buf_simple_add_le16(buf: *mut net_buf_simple, val: u16_t);
}
extern "C" {
    #[doc = "  @brief Add 16-bit value at the end of the buffer"]
    #[doc = ""]
    #[doc = "  Adds 16-bit value in big endian format at the end of buffer."]
    #[doc = "  Increments the data length of a buffer to account for more data"]
    #[doc = "  at the end."]
    #[doc = ""]
    #[doc = "  @param buf Buffer to update."]
    #[doc = "  @param val 16-bit value to be added."]
    pub fn net_buf_simple_add_be16(buf: *mut net_buf_simple, val: u16_t);
}
extern "C" {
    #[doc = "  @brief Add 32-bit value at the end of the buffer"]
    #[doc = ""]
    #[doc = "  Adds 32-bit value in little endian format at the end of buffer."]
    #[doc = "  Increments the data length of a buffer to account for more data"]
    #[doc = "  at the end."]
